-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 13 يناير 2026 الساعة 17:56
-- إصدار الخادم: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `kids_learning`
--

-- --------------------------------------------------------

--
-- بنية الجدول `badges`
--

CREATE TABLE `badges` (
  `badge_id` int(11) NOT NULL,
  `badge_name` varchar(100) NOT NULL COMMENT 'اسم الشارة بالإنجليزية',
  `badge_name_ar` varchar(100) NOT NULL COMMENT 'اسم الشارة بالعربية',
  `badge_icon` varchar(50) DEFAULT NULL COMMENT 'رمز الشارة',
  `min_value` int(11) DEFAULT 0 COMMENT 'القيمة الدنيا',
  `max_value` int(11) DEFAULT 100 COMMENT 'القيمة العليا',
  `start_value` int(11) DEFAULT 0 COMMENT 'القيمة الابتدائية',
  `min_star` int(11) DEFAULT 0 COMMENT 'الحد الأدنى للنجوم',
  `max_star` int(11) DEFAULT 100 COMMENT 'الحد الأقصى للنجوم',
  `color_code` varchar(7) DEFAULT '#f59e0b' COMMENT 'كود اللون',
  `level` int(11) DEFAULT 1 COMMENT 'المستوى',
  `description` text DEFAULT NULL COMMENT 'وصف الشارة',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `badges`
--

INSERT INTO `badges` (`badge_id`, `badge_name`, `badge_name_ar`, `badge_icon`, `min_value`, `max_value`, `start_value`, `min_star`, `max_star`, `color_code`, `level`, `description`, `created_at`) VALUES
(1, 'First Task', 'المهمة الأولى', '⭐', 0, 1, 0, 0, 100, '#f59e0b', 1, 'أكمل أول مهمة', '2025-12-27 15:13:56'),
(2, 'Session Master', 'بطل الجلسة', '🏆', 1, 5, 0, 0, 100, '#6366f1', 2, 'أكمل 5 جلسات', '2025-12-27 15:13:56'),
(3, 'Time Champion', 'بطل الوقت', '⏰', 30, 100, 0, 0, 100, '#10b981', 3, 'أمضى 30 دقيقة في التعلم', '2025-12-27 15:13:56'),
(4, 'Content Expert', 'خبير المحتوى', '🎓', 10, 20, 0, 0, 100, '#ec4899', 4, 'أكمل 10 مهام', '2025-12-27 15:13:56'),
(5, 'Perfect Score', 'النتيجة المثالية', '💯', 100, 100, 0, 0, 100, '#ef4444', 5, 'حصل على 100% في مهمة', '2025-12-27 15:13:56'),
(6, 'Quick Learner', 'المتعلم السريع', '⚡', 5, 10, 0, 0, 100, '#8b5cf6', 2, 'أكمل 5 مهام بسرعة', '2025-12-27 15:13:56');

-- --------------------------------------------------------

--
-- بنية الجدول `children`
--

CREATE TABLE `children` (
  `child_id` int(11) NOT NULL,
  `child_name` varchar(200) NOT NULL,
  `parent_id` int(11) NOT NULL,
  `age` int(3) DEFAULT NULL,
  `gender` enum('ذكر','أنثى') DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `profile_img` varchar(255) DEFAULT NULL,
  `last_activity` timestamp NULL DEFAULT NULL,
  `total_time` int(11) DEFAULT 0 COMMENT 'الوقت الإجمالي بالدقائق',
  `total_stars` int(11) DEFAULT 0 COMMENT 'Total stars',
  `title` varchar(50) DEFAULT NULL COMMENT 'Current title',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `children`
--

INSERT INTO `children` (`child_id`, `child_name`, `parent_id`, `age`, `gender`, `birth_date`, `profile_img`, `last_activity`, `total_time`, `total_stars`, `title`, `created_at`, `updated_at`) VALUES
(6, 'جاسر', 3, 8, 'ذكر', '2016-05-08', NULL, '2025-12-27 19:20:28', 2, 22, 'مستكشف 🚀', '2025-12-13 19:08:09', '2025-12-27 19:20:28'),
(8, 'عبد الرزاق', 3, 6, 'ذكر', '2019-12-05', NULL, '2025-12-27 20:20:16', 1, 4, 'مبتدئ 🎈', '2025-12-13 19:16:58', '2025-12-27 20:20:16'),
(10, 'هدى', 3, 10, 'أنثى', '2015-08-09', NULL, '2025-12-27 20:56:24', 3, 22, 'مستكشف 🚀', '2025-12-13 19:26:46', '2025-12-27 20:56:24'),
(11, 'عمر', 3, 4, 'ذكر', '2021-05-11', NULL, '2025-12-27 16:09:19', 18, 50, 'نجم التعلم 🌟', '2025-12-16 17:48:20', '2025-12-27 16:09:19'),
(12, 'راما', 3, 7, 'أنثى', '2018-12-12', NULL, '2025-12-27 19:36:48', 12, 87, 'نجم التعلم 🌟', '2025-12-19 21:21:44', '2025-12-27 19:36:48'),
(13, 'نور', 3, 9, 'أنثى', '2016-09-13', NULL, '2025-12-27 19:54:41', 16, 57, 'نجم التعلم 🌟', '2025-12-19 21:22:59', '2025-12-27 19:54:41'),
(16, 'عبود', 3, 4, 'ذكر', '2021-09-09', NULL, '2025-12-27 19:26:43', 8, 58, 'نجم التعلم 🌟', '2025-12-20 12:43:07', '2025-12-27 22:56:25'),
(17, 'ميمو', 5, 5, 'أنثى', '2020-05-08', NULL, '2025-12-24 13:03:37', 0, 5, 'مبتدئ 🎈', '2025-12-24 12:59:46', '2025-12-24 13:03:37'),
(18, 'عبد الحميد', 6, 8, 'ذكر', '2017-04-09', NULL, '2025-12-26 20:35:29', 11, 43, 'نجم التعلم 🌟', '2025-12-26 19:50:20', '2025-12-26 20:35:29'),
(19, 'سدين', 3, 8, 'أنثى', '2016-12-28', NULL, '2026-01-12 14:20:45', 1, 4, 'مبتدئ 🎈', '2025-12-27 16:16:59', '2026-01-12 14:20:45'),
(20, 'لين', 3, 10, 'أنثى', '2015-08-08', NULL, '2025-12-27 21:41:49', 8, 35, 'نجم التعلم 🌟', '2025-12-27 20:56:54', '2025-12-27 21:41:49'),
(24, 'زين', 3, 5, 'ذكر', '2020-11-07', NULL, '2026-01-05 08:57:24', 6, 29, 'مستكشف 🚀', '2025-12-27 22:20:17', '2026-01-05 08:57:24'),
(25, 'احمد', 7, 6, 'ذكر', '2019-07-07', NULL, '2025-12-28 20:01:50', 6, 24, 'مستكشف 🚀', '2025-12-28 19:45:18', '2025-12-28 20:01:50'),
(26, 'ريماس', 7, 10, 'أنثى', '2015-08-09', NULL, '2025-12-28 20:31:13', 2, 11, 'مستكشف 🚀', '2025-12-28 20:18:44', '2025-12-28 20:31:13'),
(28, 'Reem', 1, 5, 'أنثى', '2020-05-08', NULL, '2026-01-04 21:18:57', 5, 33, 'نجم التعلم 🌟', '2026-01-04 20:08:09', '2026-01-04 21:18:57'),
(29, 'حميدو', 1, 4, 'ذكر', '2021-04-09', NULL, '2026-01-04 21:20:59', 2, 4, 'مبتدئ 🎈', '2026-01-04 21:19:35', '2026-01-04 21:20:59'),
(30, 'شهد', 1, 6, 'ذكر', '2019-11-09', NULL, '2026-01-04 21:26:38', 0, 4, 'مبتدئ 🎈', '2026-01-04 21:25:37', '2026-01-04 21:26:38'),
(31, 'عون', 10, 5, 'ذكر', '2020-11-09', NULL, '2026-01-12 14:15:35', 1, 8, 'مبتدئ 🎈', '2026-01-12 14:11:30', '2026-01-12 14:15:35');

-- --------------------------------------------------------

--
-- بنية الجدول `child_badges`
--

CREATE TABLE `child_badges` (
  `child_badge_id` int(11) NOT NULL,
  `child_id` int(11) NOT NULL,
  `badge_id` int(11) NOT NULL,
  `stars_earned` int(11) DEFAULT 0 COMMENT 'عدد النجوم المكتسبة',
  `awarded_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `child_badges`
--

INSERT INTO `child_badges` (`child_badge_id`, `child_id`, `badge_id`, `stars_earned`, `awarded_at`) VALUES
(1, 16, 1, 1, '2025-12-27 15:49:55'),
(2, 16, 2, 5, '2025-12-27 15:50:40'),
(3, 16, 5, 5, '2025-12-27 15:50:40'),
(4, 12, 6, 1, '2025-12-27 16:05:47'),
(5, 12, 4, 1, '2025-12-27 16:05:47'),
(6, 11, 2, 5, '2025-12-27 16:09:11'),
(7, 11, 5, 5, '2025-12-27 16:09:11'),
(8, 6, 1, 5, '2025-12-27 16:12:24'),
(9, 6, 2, 5, '2025-12-27 16:12:24'),
(10, 6, 5, 5, '2025-12-27 16:12:24'),
(11, 13, 1, 5, '2025-12-27 18:17:48'),
(12, 13, 2, 5, '2025-12-27 18:17:48'),
(13, 13, 5, 5, '2025-12-27 18:17:48'),
(14, 10, 1, 5, '2025-12-27 18:37:27'),
(15, 10, 2, 5, '2025-12-27 18:37:27'),
(16, 10, 5, 5, '2025-12-27 18:37:27'),
(17, 8, 1, 4, '2025-12-27 20:20:16'),
(18, 20, 1, 3, '2025-12-27 21:03:15'),
(19, 20, 2, 5, '2025-12-27 21:16:10'),
(20, 20, 5, 5, '2025-12-27 21:16:10'),
(21, 20, 6, 1, '2025-12-27 21:41:47'),
(25, 24, 1, 5, '2025-12-27 22:24:21'),
(26, 24, 5, 5, '2025-12-27 22:24:21'),
(27, 24, 2, 2, '2025-12-27 22:30:10'),
(28, 24, 6, 1, '2025-12-27 22:32:31'),
(29, 25, 1, 5, '2025-12-28 19:58:06'),
(30, 25, 5, 5, '2025-12-28 19:58:06'),
(31, 25, 2, 2, '2025-12-28 19:59:29'),
(32, 26, 1, 5, '2025-12-28 20:29:51'),
(33, 26, 5, 5, '2025-12-28 20:29:51'),
(34, 28, 1, 5, '2026-01-04 20:32:19'),
(35, 28, 5, 5, '2026-01-04 20:32:19'),
(36, 29, 1, 5, '2026-01-04 21:20:56'),
(37, 30, 1, 4, '2026-01-04 21:26:38'),
(38, 31, 1, 4, '2026-01-12 14:14:29'),
(39, 19, 1, 3, '2026-01-12 14:20:45');

-- --------------------------------------------------------

--
-- بنية الجدول `content`
--

CREATE TABLE `content` (
  `content_id` int(11) NOT NULL,
  `content_name` varchar(100) NOT NULL,
  `content_name_ar` varchar(100) NOT NULL,
  `content_type` enum('لعبة','فيديو') DEFAULT 'لعبة',
  `content_url` varchar(500) DEFAULT NULL,
  `title` varchar(200) DEFAULT NULL COMMENT 'العنوان',
  `topic` varchar(200) DEFAULT NULL COMMENT 'الموضوع',
  `category` varchar(100) DEFAULT NULL COMMENT 'الفئة',
  `content_category` enum('عربي','علوم','رياضيات') DEFAULT NULL,
  `difficulty` enum('سهل','متوسط','صعب') DEFAULT 'سهل' COMMENT 'الصعوبة',
  `min_age` int(3) DEFAULT 3 COMMENT 'الحد الأدنى للعمر',
  `max_age` int(3) DEFAULT 12 COMMENT 'الحد الأقصى للعمر',
  `icon` varchar(50) DEFAULT NULL COMMENT 'الأيقونة',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `content`
--

INSERT INTO `content` (`content_id`, `content_name`, `content_name_ar`, `content_type`, `content_url`, `title`, `topic`, `category`, `content_category`, `difficulty`, `min_age`, `max_age`, `icon`, `created_at`) VALUES
(109, 'math_game_add_subtract', 'لعبة الجمع والطرح', 'لعبة', 'http://localhost/kids_learning/html/math_game.html', 'لعبة الجمع والطرح', NULL, 'تعليمي', 'رياضيات', 'سهل', 4, 12, '🔢', '2025-12-16 18:26:00'),
(110, 'math_game_age_4', 'لعبة الجمع والطرح للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=4', 'لعبة الجمع والطرح - عمر 4 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 4, 4, '🔢', '2025-12-16 18:37:31'),
(111, 'math_game_age_5', 'لعبة الجمع والطرح للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=5', 'لعبة الجمع والطرح - عمر 5 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 5, 5, '🔢', '2025-12-16 18:37:31'),
(112, 'math_game_age_6', 'لعبة الجمع والطرح للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=6', 'لعبة الجمع والطرح - عمر 6 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 6, 6, '🔢', '2025-12-16 18:37:31'),
(113, 'math_game_age_7', 'لعبة الجمع والطرح للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=7', 'لعبة الجمع والطرح - عمر 7 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 7, 7, '🔢', '2025-12-16 18:37:31'),
(114, 'math_game_age_8', 'لعبة الجمع والطرح للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=8', 'لعبة الجمع والطرح - عمر 8 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 8, 8, '🔢', '2025-12-16 18:37:31'),
(115, 'math_game_age_9', 'لعبة الجمع والطرح للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=9', 'لعبة الجمع والطرح - عمر 9 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 9, 9, '🔢', '2025-12-16 18:37:31'),
(116, 'math_game_age_10', 'لعبة الجمع والطرح للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=10', 'لعبة الجمع والطرح - عمر 10 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 10, 10, '🔢', '2025-12-16 18:37:31'),
(117, 'math_game_age_11', 'لعبة الجمع والطرح للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=11', 'لعبة الجمع والطرح - عمر 11 سنة', NULL, 'تعليمي', 'رياضيات', 'سهل', 11, 11, '🔢', '2025-12-16 18:37:31'),
(118, 'math_game_age_12', 'لعبة الجمع والطرح للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/math_game.html?age=12', 'لعبة الجمع والطرح - عمر 12 سنة', NULL, 'تعليمي', 'رياضيات', 'سهل', 12, 12, '🔢', '2025-12-16 18:37:31'),
(119, 'math_comparison_age_4', 'لعبة المقارنة للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=4', 'لعبة المقارنة - عمر 4 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 4, 4, '🔢', '2025-12-16 20:21:32'),
(120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=5', 'لعبة المقارنة - عمر 5 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 5, 5, '🔢', '2025-12-16 20:21:32'),
(121, 'math_comparison_age_6', 'لعبة المقارنة للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=6', 'لعبة المقارنة - عمر 6 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 6, 6, '🔢', '2025-12-16 20:21:32'),
(122, 'math_comparison_age_7', 'لعبة المقارنة للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=7', 'لعبة المقارنة - عمر 7 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 7, 7, '🔢', '2025-12-16 20:21:32'),
(123, 'math_comparison_age_8', 'لعبة المقارنة للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=8', 'لعبة المقارنة - عمر 8 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 8, 8, '🔢', '2025-12-16 20:21:32'),
(124, 'math_comparison_age_9', 'لعبة المقارنة للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=9', 'لعبة المقارنة - عمر 9 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 9, 9, '🔢', '2025-12-16 20:21:32'),
(125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=10', 'لعبة المقارنة - عمر 10 سنوات', NULL, 'تعليمي', 'رياضيات', 'سهل', 10, 10, '🔢', '2025-12-16 20:21:33'),
(126, 'math_comparison_age_11', 'لعبة المقارنة للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=11', 'لعبة المقارنة - عمر 11 سنة', NULL, 'تعليمي', 'رياضيات', 'سهل', 11, 11, '🔢', '2025-12-16 20:21:33'),
(127, 'math_comparison_age_12', 'لعبة المقارنة للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/math_comparison_game.html?age=12', 'لعبة المقارنة - عمر 12 سنة', NULL, 'تعليمي', 'رياضيات', 'سهل', 12, 12, '🔢', '2025-12-16 20:21:33'),
(128, 'arabic_game_age_4', 'لعبة الحروف العربية للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=4', 'لعبة الحروف العربية - عمر 4 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 4, 4, '📚', '2025-12-16 20:32:46'),
(129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=5', 'لعبة الحروف العربية - عمر 5 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 5, 5, '📚', '2025-12-16 20:32:46'),
(130, 'arabic_game_age_6', 'لعبة الحروف العربية للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=6', 'لعبة الحروف العربية - عمر 6 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 6, 6, '📚', '2025-12-16 20:32:46'),
(131, 'arabic_game_age_7', 'لعبة الحروف العربية للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=7', 'لعبة الحروف العربية - عمر 7 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 7, 7, '📚', '2025-12-16 20:32:46'),
(132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=8', 'لعبة الحروف العربية - عمر 8 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 8, 8, '📚', '2025-12-16 20:32:46'),
(133, 'arabic_game_age_9', 'لعبة الحروف العربية للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=9', 'لعبة الحروف العربية - عمر 9 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 9, 9, '📚', '2025-12-16 20:32:46'),
(134, 'arabic_game_age_10', 'لعبة الحروف العربية للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=10', 'لعبة الحروف العربية - عمر 10 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 10, 10, '📚', '2025-12-16 20:32:46'),
(135, 'arabic_game_age_11', 'لعبة الحروف العربية للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=11', 'لعبة الحروف العربية - عمر 11 سنة', NULL, 'تعليمي', 'عربي', 'سهل', 11, 11, '📚', '2025-12-16 20:32:46'),
(136, 'arabic_game_age_12', 'لعبة الحروف العربية للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/arabic_game.html?age=12', 'لعبة الحروف العربية - عمر 12 سنة', NULL, 'تعليمي', 'عربي', 'سهل', 12, 12, '📚', '2025-12-16 20:32:46'),
(137, 'arabic_word_formation_age_4', 'لعبة تكوين الكلمات للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=4', 'لعبة تكوين الكلمات - عمر 4 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 4, 4, '📚', '2025-12-16 20:51:46'),
(138, 'arabic_word_formation_age_5', 'لعبة تكوين الكلمات للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=5', 'لعبة تكوين الكلمات - عمر 5 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 5, 5, '📚', '2025-12-16 20:51:46'),
(139, 'arabic_word_formation_age_6', 'لعبة تكوين الكلمات للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=6', 'لعبة تكوين الكلمات - عمر 6 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 6, 6, '📚', '2025-12-16 20:51:46'),
(140, 'arabic_word_formation_age_7', 'لعبة تكوين الكلمات للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=7', 'لعبة تكوين الكلمات - عمر 7 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 7, 7, '📚', '2025-12-16 20:51:46'),
(141, 'arabic_word_formation_age_8', 'لعبة تكوين الكلمات للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=8', 'لعبة تكوين الكلمات - عمر 8 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 8, 8, '📚', '2025-12-16 20:51:46'),
(142, 'arabic_word_formation_age_9', 'لعبة تكوين الكلمات للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=9', 'لعبة تكوين الكلمات - عمر 9 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 9, 9, '📚', '2025-12-16 20:51:46'),
(143, 'arabic_word_formation_age_10', 'لعبة تكوين الكلمات للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=10', 'لعبة تكوين الكلمات - عمر 10 سنوات', NULL, 'تعليمي', 'عربي', 'سهل', 10, 10, '📚', '2025-12-16 20:51:46'),
(144, 'arabic_word_formation_age_11', 'لعبة تكوين الكلمات للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=11', 'لعبة تكوين الكلمات - عمر 11 سنة', NULL, 'تعليمي', 'عربي', 'سهل', 11, 11, '📚', '2025-12-16 20:51:46'),
(145, 'arabic_word_formation_age_12', 'لعبة تكوين الكلمات للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/arabic_word_formation_game.html?age=12', 'لعبة تكوين الكلمات - عمر 12 سنة', NULL, 'تعليمي', 'عربي', 'سهل', 12, 12, '📚', '2025-12-16 20:51:46'),
(146, 'science_animals_game_age_4', 'لعبة تصنيف الحيوانات للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=4', 'لعبة تصنيف الحيوانات - عمر 4 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 4, 4, '🔬', '2025-12-19 20:37:24'),
(147, 'science_animals_game_age_5', 'لعبة تصنيف الحيوانات للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=5', 'لعبة تصنيف الحيوانات - عمر 5 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 5, 5, '🔬', '2025-12-19 20:37:24'),
(148, 'science_animals_game_age_6', 'لعبة تصنيف الحيوانات للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=6', 'لعبة تصنيف الحيوانات - عمر 6 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 6, 6, '🔬', '2025-12-19 20:37:24'),
(149, 'science_animals_game_age_7', 'لعبة تصنيف الحيوانات للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=7', 'لعبة تصنيف الحيوانات - عمر 7 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 7, 7, '🔬', '2025-12-19 20:37:24'),
(150, 'science_animals_game_age_8', 'لعبة تصنيف الحيوانات للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=8', 'لعبة تصنيف الحيوانات - عمر 8 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 8, 8, '🔬', '2025-12-19 20:37:24'),
(151, 'science_animals_game_age_9', 'لعبة تصنيف الحيوانات للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=9', 'لعبة تصنيف الحيوانات - عمر 9 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 9, 9, '🔬', '2025-12-19 20:37:24'),
(152, 'science_animals_game_age_10', 'لعبة تصنيف الحيوانات للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=10', 'لعبة تصنيف الحيوانات - عمر 10 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 10, 10, '🔬', '2025-12-19 20:37:24'),
(153, 'science_animals_game_age_11', 'لعبة تصنيف الحيوانات للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=11', 'لعبة تصنيف الحيوانات - عمر 11 سنة', NULL, 'تعليمي', 'علوم', 'سهل', 11, 11, '🔬', '2025-12-19 20:37:24'),
(154, 'science_animals_game_age_12', 'لعبة تصنيف الحيوانات للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/science_animals_game.html?age=12', 'لعبة تصنيف الحيوانات - عمر 12 سنة', NULL, 'تعليمي', 'علوم', 'سهل', 12, 12, '🔬', '2025-12-19 20:37:24'),
(155, 'science_senses_game_age_4', 'لعبة الحواس الخمسة للعمر 4', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=4', 'لعبة الحواس الخمسة - عمر 4 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 4, 4, '🔬', '2025-12-19 21:06:15'),
(156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=5', 'لعبة الحواس الخمسة - عمر 5 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 5, 5, '🔬', '2025-12-19 21:06:15'),
(157, 'science_senses_game_age_6', 'لعبة الحواس الخمسة للعمر 6', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=6', 'لعبة الحواس الخمسة - عمر 6 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 6, 6, '🔬', '2025-12-19 21:06:15'),
(158, 'science_senses_game_age_7', 'لعبة الحواس الخمسة للعمر 7', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=7', 'لعبة الحواس الخمسة - عمر 7 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 7, 7, '🔬', '2025-12-19 21:06:15'),
(159, 'science_senses_game_age_8', 'لعبة الحواس الخمسة للعمر 8', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=8', 'لعبة الحواس الخمسة - عمر 8 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 8, 8, '🔬', '2025-12-19 21:06:15'),
(160, 'science_senses_game_age_9', 'لعبة الحواس الخمسة للعمر 9', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=9', 'لعبة الحواس الخمسة - عمر 9 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 9, 9, '🔬', '2025-12-19 21:06:15'),
(161, 'science_senses_game_age_10', 'لعبة الحواس الخمسة للعمر 10', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=10', 'لعبة الحواس الخمسة - عمر 10 سنوات', NULL, 'تعليمي', 'علوم', 'سهل', 10, 10, '🔬', '2025-12-19 21:06:15'),
(162, 'science_senses_game_age_11', 'لعبة الحواس الخمسة للعمر 11', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=11', 'لعبة الحواس الخمسة - عمر 11 سنة', NULL, 'تعليمي', 'علوم', 'سهل', 11, 11, '🔬', '2025-12-19 21:06:15'),
(163, 'science_senses_game_age_12', 'لعبة الحواس الخمسة للعمر 12', 'لعبة', 'http://localhost/kids_learning/html/science_senses_game.html?age=12', 'لعبة الحواس الخمسة - عمر 12 سنة', NULL, 'تعليمي', 'علوم', 'سهل', 12, 12, '🔬', '2025-12-19 21:06:15');

-- --------------------------------------------------------

--
-- بنية الجدول `parents`
--

CREATE TABLE `parents` (
  `id` int(11) NOT NULL,
  `first_name` varchar(100) NOT NULL,
  `last_name` varchar(100) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `password` varchar(255) NOT NULL,
  `gender` enum('أب','أم') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `parents`
--

INSERT INTO `parents` (`id`, `first_name`, `last_name`, `email`, `phone`, `password`, `gender`, `created_at`, `updated_at`) VALUES
(1, 'memo', 'salah', 'reem9112@gmail.com', '0781873734', '$2y$10$U3/tn/nl4JJV6RSp.s8aBu5nIAvQBsFqaydBEii59vUxSphaVEW8W', 'أم', '2025-11-25 22:54:05', '2025-11-25 22:54:05'),
(2, 'shahed', 'alshaikh', 'shahed@ghmail.com', '0795020367', '$2y$10$8/dB9pOri7J3r86yrs9vcuO6XN/Qi4vKheKEYm0W/0C.pgJGz05d2', 'أم', '2025-12-03 09:27:21', '2025-12-03 09:27:21'),
(3, 'تسنيم', 'النجار', 'sarahalseidy@gmail.com', '0781412215', '$2y$10$3dw/VuxLRlGhIoQA/d.utef7tY8Tl1fwo.oDTYCk.OsuqFFxDrZWO', 'أم', '2025-12-13 18:26:38', '2025-12-27 22:54:20'),
(4, 'sarah', 'alseidy', 'sarahalseidy8@gmail.com', '0789080501', '$2y$10$CR9Mi68YeJXcTlKKEki1UejwwNkAYsG/QFq5Ogu5lwobJjeDCGeay', 'أم', '2025-12-13 18:36:34', '2025-12-13 18:36:34'),
(5, 'ammar', 'agha', 'Ammaralagha@gmail.com', '0790679021', '$2y$10$V2xfyw6xYPgHP/eLJZIgK.d7EaAvXjOXkNnc4gyB62Gwg2aAlFQvu', 'أب', '2025-12-24 12:58:51', '2025-12-24 12:58:51'),
(6, 'hameed', 'salah', 'hameed@gmail.com', '0785084977', '$2y$10$JYM7om1tBPxqVJqpAyQh1OSleXV9M4giDqYzOoJxSxUI48HKq77Ve', 'أب', '2025-12-26 19:48:52', '2025-12-26 19:48:52'),
(7, 'rama', 'tareq', 'ramatareq@gmail.com', '0782144924', '$2y$10$cHmtJXyOtj61kjy92l/hJeT4v3jG7Kk9AoqXJe7Wo4IeNnJ7ziceW', 'أم', '2025-12-28 19:44:34', '2025-12-28 19:44:34'),
(8, 'abood', 'salah', 'aboodsalah@gmail.com', '0777777895', '$2y$10$4hfgKqdZhRuDCfhMbBuB2.Uleo7./Ete17bEfNgLD.eI8FgdOka9y', 'أب', '2026-01-11 12:51:46', '2026-01-11 12:51:46'),
(9, 'razan', 'mardi', 'razanmardi@gmail.com', '0785362149', '$2y$10$0Ljdtp5ogtuSHkMRMTsU0.oJToQ4wpkh3C501DuzHp8wNB/kVTND.', 'أم', '2026-01-11 13:06:14', '2026-01-11 13:06:14'),
(10, 'لين', 'العمري', 'leen@gmail.com', '0795020365', '$2y$10$WhwWo9IoBouIV8hSLb7FCu6a7Qm14pEbmoadwCn/rN7yNmyvGP0Ja', 'أم', '2026-01-12 14:10:08', '2026-01-12 14:10:08');

-- --------------------------------------------------------

--
-- بنية الجدول `reports`
--

CREATE TABLE `reports` (
  `report_id` int(11) NOT NULL,
  `parent_id` int(11) NOT NULL,
  `child_id` int(11) NOT NULL,
  `session_id` int(11) DEFAULT NULL,
  `achievement` text DEFAULT NULL COMMENT 'الإنجازات',
  `report_data` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'بيانات التقرير بصيغة JSON' CHECK (json_valid(`report_data`)),
  `pages_rendered` int(11) DEFAULT 0 COMMENT 'عدد الصفحات المعروضة',
  `total_time` int(11) DEFAULT 0 COMMENT 'الوقت الإجمالي بالدقائق',
  `generated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `viewed_by_parent` tinyint(1) DEFAULT 0 COMMENT 'تمت مشاهدته من قبل الأهل (0 أو 1)',
  `viewed_at` timestamp NULL DEFAULT NULL COMMENT 'وقت المشاهدة'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `reports`
--

INSERT INTO `reports` (`report_id`, `parent_id`, `child_id`, `session_id`, `achievement`, `report_data`, `pages_rendered`, `total_time`, `generated_at`, `viewed_by_parent`, `viewed_at`) VALUES
(1, 3, 16, 132, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"عبود\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"22\",\"total_time\":\"3\"}', 0, 0, '2025-12-27 15:50:40', 0, NULL),
(2, 3, 16, 132, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"27\",\"total_time\":\"3\"}', 0, 0, '2025-12-27 15:51:35', 0, NULL),
(3, 3, 11, 135, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 4\",\"content_name\":\"لعبة المقارنة للعمر 4\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"عمر\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"45\",\"total_time\":\"17\",\"session_date\":\"2025-12-27\",\"session_time\":\"19:07\",\"start_time\":\"2025-12-27 19:07:57\",\"end_time\":\"2025-12-27 19:09:11\"}', 0, 1, '2025-12-27 16:09:11', 0, NULL),
(4, 3, 11, 135, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 4\",\"content_name\":\"لعبة المقارنة للعمر 4\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عمر\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"50\",\"total_time\":\"18\",\"session_date\":\"2025-12-27\",\"session_time\":\"19:07\",\"start_time\":\"2025-12-27 19:07:57\",\"end_time\":\"2025-12-27 19:09:19\"}', 0, 1, '2025-12-27 16:09:19', 0, NULL),
(5, 3, 6, 136, 'تم الحصول على 3 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 8\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 8\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":3,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"جاسر\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"5\",\"total_time\":\"0\",\"session_date\":\"2025-12-27\",\"session_time\":\"19:11\",\"start_time\":\"2025-12-27 19:11:24\",\"end_time\":\"2025-12-27 19:12:24\"}', 0, 0, '2025-12-27 16:12:24', 0, NULL),
(6, 3, 6, 137, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 8\",\"content_name\":\"لعبة الحواس الخمسة للعمر 8\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"جاسر\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"10\",\"total_time\":\"0\",\"session_date\":\"2025-12-27\",\"session_time\":\"19:20\",\"start_time\":\"2025-12-27 19:20:09\",\"end_time\":\"2025-12-27 19:21:09\"}', 0, 0, '2025-12-27 16:21:09', 0, NULL),
(7, 3, 16, 138, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"32\",\"total_time\":\"3\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:07\",\"start_time\":\"2025-12-27 21:07:07\",\"end_time\":\"2025-12-27 21:07:46\"}', 0, 0, '2025-12-27 18:07:46', 0, NULL),
(8, 3, 16, 139, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 5\",\"content_name\":\"لعبة الجمع والطرح للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"37\",\"total_time\":\"3\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:14\",\"start_time\":\"2025-12-27 21:14:47\",\"end_time\":\"2025-12-27 21:15:36\"}', 0, 0, '2025-12-27 18:15:36', 0, NULL),
(9, 3, 16, 139, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 5\",\"content_name\":\"لعبة الجمع والطرح للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"42\",\"total_time\":\"4\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:14\",\"start_time\":\"2025-12-27 21:14:47\",\"end_time\":\"2025-12-27 21:15:40\"}', 0, 1, '2025-12-27 18:15:40', 0, NULL),
(10, 3, 13, 141, 'تم الحصول على 3 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 9\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 9\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":3,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"نور\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"21\",\"total_time\":\"8\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:16\",\"start_time\":\"2025-12-27 21:16:57\",\"end_time\":\"2025-12-27 21:17:48\"}', 0, 0, '2025-12-27 18:17:48', 0, NULL),
(11, 3, 13, 142, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 9\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 9\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"26\",\"total_time\":\"9\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:25\",\"start_time\":\"2025-12-27 21:25:14\",\"end_time\":\"2025-12-27 21:26:16\"}', 0, 1, '2025-12-27 18:26:16', 0, NULL),
(12, 3, 16, 144, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 5\",\"content_name\":\"لعبة المقارنة للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"48\",\"total_time\":\"6\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:33\",\"start_time\":\"2025-12-27 21:33:29\",\"end_time\":\"2025-12-27 21:34:46\"}', 0, 1, '2025-12-27 18:34:46', 0, NULL),
(13, 3, 10, 145, 'تم الحصول على 3 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 10\",\"content_name\":\"لعبة الحروف العربية للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":3,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"هدى\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"5\",\"total_time\":\"0\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:36\",\"start_time\":\"2025-12-27 21:36:40\",\"end_time\":\"2025-12-27 21:37:27\"}', 0, 0, '2025-12-27 18:37:27', 0, NULL),
(14, 3, 10, 146, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"هدى\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"12\",\"total_time\":\"0\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:41\",\"start_time\":\"2025-12-27 21:41:13\",\"end_time\":\"2025-12-27 21:42:13\"}', 0, 0, '2025-12-27 18:42:13', 0, NULL),
(15, 3, 13, 147, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الجمع والطرح للعمر 9\",\"content_name\":\"لعبة الجمع والطرح للعمر 9\",\"duration_minutes\":1,\"completed_percentage\":50,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"32\",\"total_time\":\"10\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:52\",\"start_time\":\"2025-12-27 21:52:15\",\"end_time\":\"2025-12-27 21:53:58\"}', 0, 1, '2025-12-27 18:53:58', 0, NULL),
(16, 3, 13, 148, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الجمع والطرح للعمر 9\",\"content_name\":\"لعبة الجمع والطرح للعمر 9\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"37\",\"total_time\":\"12\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:57\",\"start_time\":\"2025-12-27 21:57:41\",\"end_time\":\"2025-12-27 21:59:00\"}', 0, 1, '2025-12-27 18:59:00', 0, NULL),
(17, 3, 13, 149, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 9\",\"content_name\":\"لعبة الحواس الخمسة للعمر 9\",\"duration_minutes\":0,\"completed_percentage\":70,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"43\",\"total_time\":\"13\",\"session_date\":\"2025-12-27\",\"session_time\":\"21:59\",\"start_time\":\"2025-12-27 21:59:25\",\"end_time\":\"2025-12-27 22:00:24\"}', 0, 0, '2025-12-27 19:00:24', 0, NULL),
(18, 3, 13, 150, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 9\",\"content_name\":\"لعبة المقارنة للعمر 9\",\"duration_minutes\":0,\"completed_percentage\":40,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"47\",\"total_time\":\"13\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:03\",\"start_time\":\"2025-12-27 22:03:26\",\"end_time\":\"2025-12-27 22:04:23\"}', 0, 0, '2025-12-27 19:04:23', 0, NULL),
(19, 3, 13, 151, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 9\",\"content_name\":\"لعبة المقارنة للعمر 9\",\"duration_minutes\":0,\"completed_percentage\":50,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"51\",\"total_time\":\"14\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:06\",\"start_time\":\"2025-12-27 22:06:13\",\"end_time\":\"2025-12-27 22:06:56\"}', 0, 0, '2025-12-27 19:06:56', 0, NULL),
(20, 3, 6, 152, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 8\",\"content_name\":\"لعبة المقارنة للعمر 8\",\"duration_minutes\":0,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"جاسر\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"13\",\"total_time\":\"0\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:13\",\"start_time\":\"2025-12-27 22:13:48\",\"end_time\":\"2025-12-27 22:14:39\"}', 0, 0, '2025-12-27 19:14:39', 0, NULL),
(21, 3, 6, 153, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 8\",\"content_name\":\"لعبة المقارنة للعمر 8\",\"duration_minutes\":0,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"جاسر\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"19\",\"total_time\":\"1\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:19\",\"start_time\":\"2025-12-27 22:19:36\",\"end_time\":\"2025-12-27 22:20:26\"}', 0, 0, '2025-12-27 19:20:26', 0, NULL),
(22, 3, 6, 153, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 8\",\"content_name\":\"لعبة المقارنة للعمر 8\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"جاسر\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"22\",\"total_time\":\"2\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:19\",\"start_time\":\"2025-12-27 22:19:36\",\"end_time\":\"2025-12-27 22:20:28\"}', 0, 1, '2025-12-27 19:20:28', 0, NULL),
(23, 3, 16, 154, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 5\",\"content_name\":\"لعبة المقارنة للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"55\",\"total_time\":\"7\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:25\",\"start_time\":\"2025-12-27 22:25:37\",\"end_time\":\"2025-12-27 22:26:38\"}', 0, 0, '2025-12-27 19:26:38', 0, NULL),
(24, 3, 16, 154, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 5\",\"content_name\":\"لعبة المقارنة للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"عبود\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"58\",\"total_time\":\"8\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:25\",\"start_time\":\"2025-12-27 22:25:37\",\"end_time\":\"2025-12-27 22:26:43\"}', 0, 1, '2025-12-27 19:26:43', 0, NULL),
(25, 3, 12, 155, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 7\",\"content_name\":\"لعبة المقارنة للعمر 7\",\"duration_minutes\":0,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"راما\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"76\",\"total_time\":\"9\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:33\",\"start_time\":\"2025-12-27 22:33:32\",\"end_time\":\"2025-12-27 22:34:28\"}', 0, 0, '2025-12-27 19:34:28', 0, NULL),
(26, 3, 12, 155, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 7\",\"content_name\":\"لعبة المقارنة للعمر 7\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"راما\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"79\",\"total_time\":\"10\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:33\",\"start_time\":\"2025-12-27 22:33:32\",\"end_time\":\"2025-12-27 22:34:34\"}', 0, 1, '2025-12-27 19:34:34', 0, NULL),
(27, 3, 12, 156, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 7\",\"content_name\":\"لعبة الجمع والطرح للعمر 7\",\"duration_minutes\":1,\"completed_percentage\":90,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"راما\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"83\",\"total_time\":\"11\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:35\",\"start_time\":\"2025-12-27 22:35:38\",\"end_time\":\"2025-12-27 22:36:41\"}', 0, 1, '2025-12-27 19:36:41', 0, NULL),
(28, 3, 12, 156, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 7\",\"content_name\":\"لعبة الجمع والطرح للعمر 7\",\"duration_minutes\":1,\"completed_percentage\":90,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"راما\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"87\",\"total_time\":\"12\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:35\",\"start_time\":\"2025-12-27 22:35:38\",\"end_time\":\"2025-12-27 22:36:48\"}', 0, 1, '2025-12-27 19:36:48', 0, NULL),
(29, 3, 13, 157, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 9\",\"content_name\":\"لعبة الحواس الخمسة للعمر 9\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"نور\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"57\",\"total_time\":\"16\",\"session_date\":\"2025-12-27\",\"session_time\":\"22:53\",\"start_time\":\"2025-12-27 22:53:33\",\"end_time\":\"2025-12-27 22:54:41\"}', 0, 1, '2025-12-27 19:54:41', 0, NULL),
(30, 3, 8, 158, 'تم الحصول على 1 شارة جديدة، حصول على 4 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 6\",\"content_name\":\"لعبة الحواس الخمسة للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":90,\"stars\":4,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":4}],\"child_name\":\"عبد الرزاق\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"1\",\"session_date\":\"2025-12-27\",\"session_time\":\"23:18\",\"start_time\":\"2025-12-27 23:18:42\",\"end_time\":\"2025-12-27 23:20:16\"}', 0, 1, '2025-12-27 20:20:16', 0, NULL),
(31, 3, 10, 159, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"هدى\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"18\",\"total_time\":\"2\",\"session_date\":\"2025-12-27\",\"session_time\":\"23:55\",\"start_time\":\"2025-12-27 23:55:11\",\"end_time\":\"2025-12-27 23:56:20\"}', 0, 1, '2025-12-27 20:56:20', 0, NULL),
(32, 3, 10, 159, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"هدى\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"22\",\"total_time\":\"3\",\"session_date\":\"2025-12-27\",\"session_time\":\"23:55\",\"start_time\":\"2025-12-27 23:55:11\",\"end_time\":\"2025-12-27 23:56:24\"}', 0, 1, '2025-12-27 20:56:24', 0, NULL),
(33, 3, 20, 160, 'تم الحصول على 1 شارة جديدة', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":2,\"completed_percentage\":70,\"stars\":3,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":3}],\"child_name\":\"لين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"3\",\"total_time\":\"2\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:00\",\"start_time\":\"2025-12-28 00:00:36\",\"end_time\":\"2025-12-28 00:03:15\"}', 0, 2, '2025-12-27 21:03:15', 0, NULL),
(34, 3, 20, 160, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":2,\"completed_percentage\":70,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"لين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"6\",\"total_time\":\"4\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:00\",\"start_time\":\"2025-12-28 00:00:36\",\"end_time\":\"2025-12-28 00:03:17\"}', 0, 2, '2025-12-27 21:03:17', 0, NULL),
(35, 3, 20, 161, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 10\",\"content_name\":\"لعبة الحواس الخمسة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"لين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"10\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:04\",\"start_time\":\"2025-12-28 00:04:41\",\"end_time\":\"2025-12-28 00:06:19\"}', 0, 1, '2025-12-27 21:06:19', 0, NULL),
(36, 3, 20, 162, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 10\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"لين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"14\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:07\",\"start_time\":\"2025-12-28 00:07:03\",\"end_time\":\"2025-12-28 00:07:56\"}', 0, 0, '2025-12-27 21:07:56', 0, NULL),
(37, 3, 20, 164, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"لين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"20\",\"total_time\":\"6\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:15\",\"start_time\":\"2025-12-28 00:15:20\",\"end_time\":\"2025-12-28 00:16:10\"}', 0, 0, '2025-12-27 21:16:10', 0, NULL),
(38, 3, 20, 164, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"لين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"25\",\"total_time\":\"7\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:15\",\"start_time\":\"2025-12-28 00:15:20\",\"end_time\":\"2025-12-28 00:16:11\"}', 0, 1, '2025-12-27 21:16:11', 0, NULL),
(39, 3, 20, 165, 'تم الحصول على 1 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"6\",\"badge_name\":\"Quick Learner\",\"badge_name_ar\":\"المتعلم السريع\",\"badge_icon\":\"⚡\",\"color_code\":\"#8b5cf6\",\"level\":\"2\",\"stars_earned\":1}],\"child_name\":\"لين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"30\",\"total_time\":\"7\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:40\",\"start_time\":\"2025-12-28 00:40:53\",\"end_time\":\"2025-12-28 00:41:47\"}', 0, 0, '2025-12-27 21:41:47', 0, NULL),
(40, 3, 20, 165, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"لين\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"35\",\"total_time\":\"8\",\"session_date\":\"2025-12-28\",\"session_time\":\"00:40\",\"start_time\":\"2025-12-28 00:40:53\",\"end_time\":\"2025-12-28 00:41:49\"}', 0, 1, '2025-12-27 21:41:49', 0, NULL),
(46, 3, 24, 170, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":0,\"stars\":0,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"0\",\"total_time\":\"3\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:21\",\"start_time\":\"2025-12-28 01:21:33\",\"end_time\":\"2025-12-28 01:22:43\"}', 0, 1, '2025-12-27 22:22:43', 0, NULL),
(47, 3, 24, 170, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":0,\"stars\":0,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"0\",\"total_time\":\"4\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:21\",\"start_time\":\"2025-12-28 01:21:33\",\"end_time\":\"2025-12-28 01:22:59\"}', 0, 1, '2025-12-27 22:22:59', 0, NULL),
(48, 3, 24, 171, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 5\",\"content_name\":\"لعبة الجمع والطرح للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"زين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"5\",\"total_time\":\"4\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:23\",\"start_time\":\"2025-12-28 01:23:41\",\"end_time\":\"2025-12-28 01:24:21\"}', 0, 0, '2025-12-27 22:24:21', 0, NULL),
(49, 3, 24, 171, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الجمع والطرح للعمر 5\",\"content_name\":\"لعبة الجمع والطرح للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"10\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:23\",\"start_time\":\"2025-12-28 01:23:41\",\"end_time\":\"2025-12-28 01:24:25\"}', 0, 1, '2025-12-27 22:24:26', 0, NULL),
(50, 3, 24, 172, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":40,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"12\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:27\",\"start_time\":\"2025-12-28 01:27:41\",\"end_time\":\"2025-12-28 01:28:29\"}', 0, 0, '2025-12-27 22:28:29', 0, NULL),
(51, 3, 24, 172, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":40,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"14\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:27\",\"start_time\":\"2025-12-28 01:27:41\",\"end_time\":\"2025-12-28 01:28:35\"}', 0, 0, '2025-12-27 22:28:35', 0, NULL),
(52, 3, 24, 173, 'تم الحصول على 1 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تكوين الكلمات للعمر 5\",\"content_name\":\"لعبة تكوين الكلمات للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":2}],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"19\",\"total_time\":\"6\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:28\",\"start_time\":\"2025-12-28 01:28:41\",\"end_time\":\"2025-12-28 01:30:10\"}', 0, 1, '2025-12-27 22:30:10', 0, NULL),
(53, 3, 24, 174, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 5\",\"content_name\":\"لعبة الحواس الخمسة للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"24\",\"total_time\":\"6\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:31\",\"start_time\":\"2025-12-28 01:31:03\",\"end_time\":\"2025-12-28 01:31:40\"}', 0, 0, '2025-12-27 22:31:40', 0, NULL),
(54, 3, 24, 175, 'تم الحصول على 1 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"6\",\"badge_name\":\"Quick Learner\",\"badge_name_ar\":\"المتعلم السريع\",\"badge_icon\":\"⚡\",\"color_code\":\"#8b5cf6\",\"level\":\"2\",\"stars_earned\":1}],\"child_name\":\"زين\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"29\",\"total_time\":\"6\",\"session_date\":\"2025-12-28\",\"session_time\":\"01:31\",\"start_time\":\"2025-12-28 01:31:48\",\"end_time\":\"2025-12-28 01:32:31\"}', 0, 0, '2025-12-27 22:32:31', 0, NULL),
(55, 7, 25, 178, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الجمع والطرح للعمر 6\",\"content_name\":\"لعبة الجمع والطرح للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":50,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"احمد\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"2\",\"total_time\":\"1\",\"session_date\":\"2025-12-28\",\"session_time\":\"22:54\",\"start_time\":\"2025-12-28 22:54:02\",\"end_time\":\"2025-12-28 22:55:52\"}', 0, 1, '2025-12-28 19:55:52', 0, NULL),
(56, 7, 25, 178, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الجمع والطرح للعمر 6\",\"content_name\":\"لعبة الجمع والطرح للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":50,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"احمد\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"2\",\"session_date\":\"2025-12-28\",\"session_time\":\"22:54\",\"start_time\":\"2025-12-28 22:54:02\",\"end_time\":\"2025-12-28 22:56:02\"}', 0, 1, '2025-12-28 19:56:02', 0, NULL),
(57, 7, 25, 179, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 6\",\"content_name\":\"لعبة الحروف العربية للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"احمد\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"9\",\"total_time\":\"3\",\"session_date\":\"2025-12-28\",\"session_time\":\"22:56\",\"start_time\":\"2025-12-28 22:56:57\",\"end_time\":\"2025-12-28 22:58:06\"}', 0, 1, '2025-12-28 19:58:06', 0, NULL),
(58, 7, 25, 179, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 6\",\"content_name\":\"لعبة الحروف العربية للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"احمد\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"14\",\"total_time\":\"4\",\"session_date\":\"2025-12-28\",\"session_time\":\"22:56\",\"start_time\":\"2025-12-28 22:56:57\",\"end_time\":\"2025-12-28 22:58:09\"}', 0, 1, '2025-12-28 19:58:09', 0, NULL),
(59, 7, 25, 180, 'تم الحصول على 1 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 6\",\"content_name\":\"لعبة الحواس الخمسة للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"2\",\"badge_name\":\"Session Master\",\"badge_name_ar\":\"بطل الجلسة\",\"badge_icon\":\"🏆\",\"color_code\":\"#6366f1\",\"level\":\"2\",\"stars_earned\":2}],\"child_name\":\"احمد\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"19\",\"total_time\":\"5\",\"session_date\":\"2025-12-28\",\"session_time\":\"22:58\",\"start_time\":\"2025-12-28 22:58:25\",\"end_time\":\"2025-12-28 22:59:29\"}', 0, 1, '2025-12-28 19:59:29', 0, NULL),
(60, 7, 25, 181, 'إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 6\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 6\",\"duration_minutes\":1,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":0,\"badges\":[],\"child_name\":\"احمد\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"24\",\"total_time\":\"6\",\"session_date\":\"2025-12-28\",\"session_time\":\"23:00\",\"start_time\":\"2025-12-28 23:00:43\",\"end_time\":\"2025-12-28 23:01:49\"}', 0, 1, '2025-12-28 20:01:50', 0, NULL),
(61, 7, 26, 182, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 10\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 10\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"ريماس\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"5\",\"total_time\":\"0\",\"session_date\":\"2025-12-28\",\"session_time\":\"23:29\",\"start_time\":\"2025-12-28 23:29:00\",\"end_time\":\"2025-12-28 23:29:51\"}', 0, 0, '2025-12-28 20:29:51', 0, NULL),
(62, 7, 26, 183, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"ريماس\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"8\",\"total_time\":\"1\",\"session_date\":\"2025-12-28\",\"session_time\":\"23:30\",\"start_time\":\"2025-12-28 23:30:06\",\"end_time\":\"2025-12-28 23:31:11\"}', 0, 1, '2025-12-28 20:31:11', 0, NULL),
(63, 7, 26, 183, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة المقارنة للعمر 10\",\"content_name\":\"لعبة المقارنة للعمر 10\",\"duration_minutes\":1,\"completed_percentage\":60,\"stars\":3,\"badges_earned\":0,\"badges\":[],\"child_name\":\"ريماس\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"11\",\"total_time\":\"2\",\"session_date\":\"2025-12-28\",\"session_time\":\"23:30\",\"start_time\":\"2025-12-28 23:30:06\",\"end_time\":\"2025-12-28 23:31:13\"}', 0, 1, '2025-12-28 20:31:13', 0, NULL),
(64, 1, 28, 184, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 5\",\"content_name\":\"لعبة المقارنة للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"1\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:28\",\"start_time\":\"2026-01-04 23:28:34\",\"end_time\":\"2026-01-04 23:29:42\"}', 0, 1, '2026-01-04 20:29:42', 0, NULL),
(65, 1, 28, 184, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة المقارنة للعمر 5\",\"content_name\":\"لعبة المقارنة للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"8\",\"total_time\":\"2\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:28\",\"start_time\":\"2026-01-04 23:28:34\",\"end_time\":\"2026-01-04 23:29:51\"}', 0, 1, '2026-01-04 20:29:51', 0, NULL),
(66, 1, 28, 185, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"12\",\"total_time\":\"2\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:30\",\"start_time\":\"2026-01-04 23:30:30\",\"end_time\":\"2026-01-04 23:31:20\"}', 0, 0, '2026-01-04 20:31:20', 0, NULL),
(67, 1, 28, 185, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"16\",\"total_time\":\"2\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:30\",\"start_time\":\"2026-01-04 23:30:30\",\"end_time\":\"2026-01-04 23:31:22\"}', 0, 0, '2026-01-04 20:31:22', 0, NULL),
(68, 1, 28, 186, 'تم الحصول على 2 شارة جديدة، إكمال المهمة بنسبة 100%، حصول على 5 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 5\",\"content_name\":\"لعبة الحواس الخمسة للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":100,\"stars\":5,\"badges_earned\":2,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5},{\"badge_id\":\"5\",\"badge_name\":\"Perfect Score\",\"badge_name_ar\":\"النتيجة المثالية\",\"badge_icon\":\"💯\",\"color_code\":\"#ef4444\",\"level\":\"5\",\"stars_earned\":5}],\"child_name\":\"Reem\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"21\",\"total_time\":\"2\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:31\",\"start_time\":\"2026-01-04 23:31:26\",\"end_time\":\"2026-01-04 23:32:19\"}', 0, 0, '2026-01-04 20:32:19', 0, NULL),
(69, 1, 28, 187, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"25\",\"total_time\":\"3\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:50\",\"start_time\":\"2026-01-04 23:50:29\",\"end_time\":\"2026-01-04 23:51:33\"}', 0, 1, '2026-01-04 20:51:33', 0, NULL),
(70, 1, 28, 187, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة الحروف العربية للعمر 5\",\"content_name\":\"لعبة الحروف العربية للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"مستكشف 🚀\",\"total_stars\":\"29\",\"total_time\":\"4\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:50\",\"start_time\":\"2026-01-04 23:50:29\",\"end_time\":\"2026-01-04 23:51:47\"}', 0, 1, '2026-01-04 20:51:47', 0, NULL),
(71, 1, 28, 188, 'حصول على 4 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"duration_minutes\":0,\"completed_percentage\":88,\"stars\":4,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"33\",\"total_time\":\"4\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:58\",\"start_time\":\"2026-01-04 23:58:29\",\"end_time\":\"2026-01-04 23:59:05\"}', 0, 0, '2026-01-04 20:59:05', 0, NULL),
(72, 1, 28, 188, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":0,\"stars\":0,\"badges_earned\":0,\"badges\":[],\"child_name\":\"Reem\",\"child_title\":\"نجم التعلم 🌟\",\"total_stars\":\"33\",\"total_time\":\"5\",\"session_date\":\"2026-01-04\",\"session_time\":\"23:58\",\"start_time\":\"2026-01-04 23:58:29\",\"end_time\":\"2026-01-05 00:18:57\"}', 0, 1, '2026-01-04 21:18:57', 0, NULL),
(73, 1, 29, 189, 'تم الحصول على 1 شارة جديدة', '{\"task_name\":\"لعبة الجمع والطرح للعمر 4\",\"content_name\":\"لعبة الجمع والطرح للعمر 4\",\"duration_minutes\":1,\"completed_percentage\":40,\"stars\":2,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":5}],\"child_name\":\"حميدو\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"2\",\"total_time\":\"1\",\"session_date\":\"2026-01-05\",\"session_time\":\"00:19\",\"start_time\":\"2026-01-05 00:19:53\",\"end_time\":\"2026-01-05 00:20:56\"}', 0, 1, '2026-01-04 21:20:56', 0, NULL),
(74, 1, 29, 189, 'تم إكمال المهمة بنجاح', '{\"task_name\":\"لعبة الجمع والطرح للعمر 4\",\"content_name\":\"لعبة الجمع والطرح للعمر 4\",\"duration_minutes\":1,\"completed_percentage\":40,\"stars\":2,\"badges_earned\":0,\"badges\":[],\"child_name\":\"حميدو\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"2\",\"session_date\":\"2026-01-05\",\"session_time\":\"00:19\",\"start_time\":\"2026-01-05 00:19:53\",\"end_time\":\"2026-01-05 00:20:59\"}', 0, 1, '2026-01-04 21:20:59', 0, NULL),
(75, 1, 30, 190, 'تم الحصول على 1 شارة جديدة، حصول على 4 نجوم', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 6\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 6\",\"duration_minutes\":0,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":4}],\"child_name\":\"شهد\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"0\",\"session_date\":\"2026-01-05\",\"session_time\":\"00:25\",\"start_time\":\"2026-01-05 00:25:55\",\"end_time\":\"2026-01-05 00:26:38\"}', 0, 0, '2026-01-04 21:26:38', 0, NULL),
(76, 10, 31, 192, 'تم الحصول على 1 شارة جديدة، حصول على 4 نجوم', '{\"task_name\":\"لعبة الحواس الخمسة للعمر 5\",\"content_name\":\"لعبة الحواس الخمسة للعمر 5\",\"duration_minutes\":1,\"completed_percentage\":80,\"stars\":4,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":4}],\"child_name\":\"عون\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"1\",\"session_date\":\"2026-01-12\",\"session_time\":\"17:13\",\"start_time\":\"2026-01-12 17:13:24\",\"end_time\":\"2026-01-12 17:14:29\"}', 0, 1, '2026-01-12 14:14:29', 0, NULL),
(77, 3, 19, 195, 'تم الحصول على 1 شارة جديدة', '{\"task_name\":\"لعبة تصنيف الحيوانات للعمر 8\",\"content_name\":\"لعبة تصنيف الحيوانات للعمر 8\",\"duration_minutes\":0,\"completed_percentage\":70,\"stars\":3,\"badges_earned\":1,\"badges\":[{\"badge_id\":\"1\",\"badge_name\":\"First Task\",\"badge_name_ar\":\"المهمة الأولى\",\"badge_icon\":\"⭐\",\"color_code\":\"#f59e0b\",\"level\":\"1\",\"stars_earned\":3}],\"child_name\":\"سدين\",\"child_title\":\"مبتدئ 🎈\",\"total_stars\":\"4\",\"total_time\":\"1\",\"session_date\":\"2026-01-12\",\"session_time\":\"17:19\",\"start_time\":\"2026-01-12 17:19:55\",\"end_time\":\"2026-01-12 17:20:45\"}', 0, 0, '2026-01-12 14:20:45', 0, NULL);

-- --------------------------------------------------------

--
-- بنية الجدول `sessions`
--

CREATE TABLE `sessions` (
  `session_id` int(11) NOT NULL,
  `child_id` int(11) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `task_id` int(11) NOT NULL,
  `content_id` int(11) DEFAULT NULL,
  `start_time` timestamp NOT NULL DEFAULT current_timestamp(),
  `end_time` timestamp NULL DEFAULT NULL,
  `duration_minutes` int(11) DEFAULT 0 COMMENT 'المدة بالدقائق',
  `completed_percentage` int(11) DEFAULT 0 COMMENT 'نسبة الإكمال من 0 إلى 100',
  `stars` int(11) DEFAULT 0 COMMENT 'Stars from 1 to 5',
  `status` enum('in_progress','completed','paused') DEFAULT 'in_progress',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `sessions`
--

INSERT INTO `sessions` (`session_id`, `child_id`, `parent_id`, `task_id`, `content_id`, `start_time`, `end_time`, `duration_minutes`, `completed_percentage`, `stars`, `status`, `created_at`) VALUES
(2, 12, NULL, 5, NULL, '2025-12-20 12:31:52', NULL, 0, 0, 0, 'in_progress', '2025-12-20 12:31:52'),
(3, 12, NULL, 5, NULL, '2025-12-20 13:52:20', NULL, 0, 0, 0, 'in_progress', '2025-12-20 13:52:20'),
(4, 12, NULL, 5, NULL, '2025-12-20 13:57:10', NULL, 0, 0, 0, 'in_progress', '2025-12-20 13:57:10'),
(5, 12, NULL, 5, NULL, '2025-12-20 13:57:28', NULL, 0, 0, 0, 'in_progress', '2025-12-20 13:57:28'),
(6, 12, NULL, 5, NULL, '2025-12-20 14:08:41', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:08:41'),
(7, 12, NULL, 5, NULL, '2025-12-20 14:09:58', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:09:58'),
(9, 12, NULL, 5, NULL, '2025-12-20 14:12:03', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:12:03'),
(10, 12, NULL, 5, NULL, '2025-12-20 14:14:04', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:14:04'),
(11, 12, NULL, 5, NULL, '2025-12-20 14:26:21', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:26:21'),
(12, 12, NULL, 5, NULL, '2025-12-20 14:31:15', NULL, 0, 0, 0, 'in_progress', '2025-12-20 14:31:15'),
(13, 12, NULL, 5, NULL, '2025-12-20 15:37:04', NULL, 0, 0, 0, 'in_progress', '2025-12-20 15:37:04'),
(14, 12, NULL, 5, NULL, '2025-12-20 15:41:27', NULL, 0, 0, 0, 'in_progress', '2025-12-20 15:41:27'),
(15, 12, NULL, 5, NULL, '2025-12-20 15:49:01', NULL, 0, 0, 0, 'in_progress', '2025-12-20 15:49:01'),
(16, 12, NULL, 5, NULL, '2025-12-20 15:50:10', NULL, 0, 0, 0, 'in_progress', '2025-12-20 15:50:10'),
(17, 12, NULL, 5, NULL, '2025-12-20 15:55:09', NULL, 0, 0, 0, 'in_progress', '2025-12-20 15:55:09'),
(18, 12, NULL, 5, NULL, '2025-12-20 16:03:11', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:03:11'),
(19, 12, NULL, 5, NULL, '2025-12-20 16:07:47', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:07:47'),
(20, 12, NULL, 5, NULL, '2025-12-20 16:11:37', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:11:37'),
(21, 12, NULL, 5, NULL, '2025-12-20 16:15:16', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:15:16'),
(22, 12, NULL, 5, NULL, '2025-12-20 16:20:30', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:20:30'),
(23, 12, NULL, 5, NULL, '2025-12-20 16:20:43', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:20:43'),
(24, 12, NULL, 5, NULL, '2025-12-20 16:22:28', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:22:28'),
(25, 12, NULL, 5, NULL, '2025-12-20 16:24:50', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:24:50'),
(26, 12, NULL, 5, NULL, '2025-12-20 16:36:37', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:36:37'),
(27, 12, NULL, 5, NULL, '2025-12-20 16:40:01', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:40:01'),
(28, 12, NULL, 5, NULL, '2025-12-20 16:43:11', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:43:11'),
(29, 12, NULL, 5, NULL, '2025-12-20 16:46:34', NULL, 0, 0, 0, 'in_progress', '2025-12-20 16:46:34'),
(30, 12, NULL, 5, NULL, '2025-12-20 17:08:07', NULL, 0, 0, 0, 'in_progress', '2025-12-20 17:08:07'),
(31, 12, NULL, 5, NULL, '2025-12-20 17:12:06', NULL, 0, 0, 0, 'in_progress', '2025-12-20 17:12:06'),
(32, 12, NULL, 5, NULL, '2025-12-20 17:26:52', NULL, 0, 0, 0, 'in_progress', '2025-12-20 17:26:52'),
(33, 12, NULL, 5, NULL, '2025-12-20 17:28:39', NULL, 0, 0, 0, 'in_progress', '2025-12-20 17:28:39'),
(34, 12, NULL, 5, NULL, '2025-12-20 17:34:11', NULL, 0, 0, 0, 'in_progress', '2025-12-20 17:34:11'),
(35, 12, NULL, 5, NULL, '2025-12-20 17:36:20', '2025-12-20 17:36:57', 0, 70, 3, 'paused', '2025-12-20 17:36:20'),
(36, 12, NULL, 2, NULL, '2025-12-20 17:37:36', '2025-12-20 17:38:48', 1, 100, 5, 'completed', '2025-12-20 17:37:36'),
(37, 12, NULL, 8, NULL, '2025-12-20 17:39:16', '2025-12-20 17:40:52', 1, 100, 5, 'completed', '2025-12-20 17:39:16'),
(38, 12, NULL, 7, NULL, '2025-12-20 17:43:26', '2025-12-20 17:44:27', 1, 100, 5, 'completed', '2025-12-20 17:43:26'),
(39, 12, NULL, 12, NULL, '2025-12-20 18:10:38', '2025-12-20 18:11:29', 0, 100, 5, 'completed', '2025-12-20 18:10:38'),
(40, 12, NULL, 13, NULL, '2025-12-23 06:44:31', '2025-12-23 06:45:45', 1, 100, 5, 'completed', '2025-12-23 06:44:31'),
(41, 12, NULL, 14, NULL, '2025-12-23 06:47:51', '2025-12-23 06:48:31', 0, 100, 5, 'completed', '2025-12-23 06:47:51'),
(43, 12, NULL, 16, NULL, '2025-12-23 07:34:11', '2025-12-23 07:37:27', 2, 100, 5, 'completed', '2025-12-23 07:34:11'),
(44, 12, NULL, 17, NULL, '2025-12-23 07:38:35', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:38:35'),
(45, 12, NULL, 17, NULL, '2025-12-23 07:42:37', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:42:37'),
(46, 12, NULL, 17, NULL, '2025-12-23 07:45:39', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:45:39'),
(47, 12, NULL, 17, NULL, '2025-12-23 07:46:37', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:46:37'),
(48, 12, NULL, 17, NULL, '2025-12-23 07:47:45', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:47:45'),
(49, 12, NULL, 17, NULL, '2025-12-23 07:49:38', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:49:38'),
(50, 12, NULL, 17, NULL, '2025-12-23 07:54:08', '2025-12-23 07:54:27', 0, 100, 5, 'completed', '2025-12-23 07:54:08'),
(51, 12, NULL, 18, NULL, '2025-12-23 07:59:25', NULL, 0, 0, 0, 'in_progress', '2025-12-23 07:59:25'),
(52, 12, NULL, 18, NULL, '2025-12-23 08:08:30', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:08:30'),
(53, 12, NULL, 18, NULL, '2025-12-23 08:12:22', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:12:22'),
(54, 12, NULL, 18, NULL, '2025-12-23 08:14:17', '2025-12-23 08:14:22', 0, 100, 5, 'completed', '2025-12-23 08:14:17'),
(55, 12, NULL, 19, NULL, '2025-12-23 08:15:35', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:15:35'),
(56, 12, NULL, 19, NULL, '2025-12-23 08:15:51', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:15:51'),
(57, 12, NULL, 19, NULL, '2025-12-23 08:15:55', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:15:55'),
(58, 12, NULL, 19, NULL, '2025-12-23 08:21:04', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:21:04'),
(59, 12, NULL, 19, NULL, '2025-12-23 08:21:19', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:21:19'),
(60, 12, NULL, 19, NULL, '2025-12-23 08:21:41', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:21:41'),
(61, 12, NULL, 19, NULL, '2025-12-23 08:27:48', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:27:48'),
(62, 12, NULL, 19, NULL, '2025-12-23 08:28:00', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:28:00'),
(63, 12, NULL, 19, NULL, '2025-12-23 08:37:41', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:37:41'),
(64, 12, NULL, 19, NULL, '2025-12-23 08:38:22', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:38:22'),
(65, 12, NULL, 19, NULL, '2025-12-23 08:42:23', NULL, 0, 0, 0, 'in_progress', '2025-12-23 08:42:23'),
(77, 12, NULL, 19, NULL, '2025-12-23 10:07:55', NULL, 0, 0, 0, 'in_progress', '2025-12-23 10:07:55'),
(78, 12, NULL, 19, NULL, '2025-12-23 10:08:38', NULL, 0, 0, 0, 'in_progress', '2025-12-23 10:08:38'),
(79, 12, NULL, 19, NULL, '2025-12-23 10:10:25', NULL, 0, 0, 0, 'in_progress', '2025-12-23 10:10:25'),
(80, 12, NULL, 19, NULL, '2025-12-23 10:13:33', '2025-12-23 10:20:26', 0, 0, 1, 'paused', '2025-12-23 10:13:33'),
(81, 12, NULL, 22, NULL, '2025-12-23 10:25:18', '2025-12-23 10:26:51', 1, 100, 5, 'completed', '2025-12-23 10:25:18'),
(82, 17, NULL, 24, NULL, '2025-12-24 13:02:29', '2025-12-24 13:03:37', 0, 100, 5, 'completed', '2025-12-24 13:02:29'),
(83, 12, NULL, 25, NULL, '2025-12-24 13:09:05', '2025-12-24 13:09:32', 0, 30, 1, 'paused', '2025-12-24 13:09:05'),
(97, 13, NULL, 35, NULL, '2025-12-25 22:38:01', '2025-12-25 22:38:18', 1, 20, 1, 'paused', '2025-12-25 22:38:01'),
(98, 13, NULL, 36, NULL, '2025-12-25 22:42:20', '2025-12-25 22:42:39', 1, 30, 1, 'paused', '2025-12-25 22:42:20'),
(100, 11, NULL, 38, NULL, '2025-12-25 22:54:00', '2025-12-25 22:54:49', 1, 100, 5, 'completed', '2025-12-25 22:54:00'),
(101, 11, NULL, 39, NULL, '2025-12-25 22:58:17', '2025-12-25 22:59:03', 1, 100, 5, 'completed', '2025-12-25 22:58:17'),
(102, 16, NULL, 42, NULL, '2025-12-25 23:04:05', '2025-12-25 23:04:14', 1, 10, 1, 'paused', '2025-12-25 23:04:05'),
(103, 11, NULL, 43, NULL, '2025-12-25 23:08:01', '2025-12-25 23:08:44', 1, 100, 5, 'completed', '2025-12-25 23:08:01'),
(104, 13, NULL, 44, NULL, '2025-12-25 23:10:04', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:10:04'),
(105, 12, NULL, 45, NULL, '2025-12-25 23:10:40', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:10:40'),
(106, 16, NULL, 47, NULL, '2025-12-25 23:14:44', '2025-12-25 23:15:07', 1, 50, 2, 'paused', '2025-12-25 23:14:44'),
(107, 16, NULL, 48, NULL, '2025-12-25 23:23:47', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:23:47'),
(108, 16, NULL, 48, NULL, '2025-12-25 23:24:32', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:24:32'),
(109, 16, NULL, 48, NULL, '2025-12-25 23:27:05', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:27:05'),
(110, 16, NULL, 48, NULL, '2025-12-25 23:27:24', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:27:24'),
(111, 16, NULL, 48, NULL, '2025-12-25 23:27:40', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:27:40'),
(112, 16, NULL, 48, NULL, '2025-12-25 23:35:27', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:35:27'),
(114, 11, NULL, 51, NULL, '2025-12-25 23:37:58', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:37:58'),
(115, 11, NULL, 52, NULL, '2025-12-25 23:39:21', '2025-12-25 23:39:30', 1, 0, 1, 'paused', '2025-12-25 23:39:21'),
(116, 11, NULL, 51, NULL, '2025-12-25 23:39:52', '2025-12-25 23:43:40', 4, 0, 1, 'paused', '2025-12-25 23:39:52'),
(117, 12, NULL, 45, NULL, '2025-12-25 23:49:48', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:49:48'),
(118, 12, NULL, 45, NULL, '2025-12-25 23:52:48', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:52:48'),
(119, 12, NULL, 45, NULL, '2025-12-25 23:54:26', NULL, 0, 0, 0, 'in_progress', '2025-12-25 23:54:26'),
(120, 18, NULL, 53, NULL, '2025-12-26 19:52:26', '2025-12-26 19:53:31', 2, 80, 4, 'paused', '2025-12-26 19:52:26'),
(121, 18, NULL, 54, NULL, '2025-12-26 19:58:41', '2025-12-26 19:59:36', 1, 100, 5, 'completed', '2025-12-26 19:58:41'),
(122, 18, NULL, 55, NULL, '2025-12-26 19:59:46', '2025-12-26 20:00:02', 1, 20, 1, 'paused', '2025-12-26 19:59:46'),
(123, 18, NULL, 56, NULL, '2025-12-26 20:03:35', '2025-12-26 20:04:37', 2, 100, 5, 'completed', '2025-12-26 20:03:35'),
(124, 18, NULL, 57, NULL, '2025-12-26 20:12:43', '2025-12-26 20:13:44', 2, 100, 5, 'completed', '2025-12-26 20:12:43'),
(125, 18, NULL, 58, NULL, '2025-12-26 20:19:12', '2025-12-26 20:20:36', 2, 20, 1, 'paused', '2025-12-26 20:19:12'),
(126, 18, NULL, 59, NULL, '2025-12-26 20:21:40', '2025-12-26 20:22:51', 2, 20, 1, 'paused', '2025-12-26 20:21:40'),
(127, 18, NULL, 60, NULL, '2025-12-26 20:27:50', '2025-12-26 20:30:20', 3, 40, 2, 'paused', '2025-12-26 20:27:50'),
(128, 18, NULL, 61, NULL, '2025-12-26 20:31:09', '2025-12-26 20:31:55', 1, 10, 1, 'paused', '2025-12-26 20:31:09'),
(129, 18, NULL, 62, NULL, '2025-12-26 20:34:52', '2025-12-26 20:35:29', 1, 50, 2, 'paused', '2025-12-26 20:34:52'),
(130, 16, NULL, 48, NULL, '2025-12-27 15:40:29', NULL, 0, 0, 0, 'in_progress', '2025-12-27 15:40:29'),
(131, 16, NULL, 48, NULL, '2025-12-27 15:49:53', '2025-12-27 15:49:55', 1, 0, 1, 'paused', '2025-12-27 15:49:53'),
(132, 16, NULL, 63, NULL, '2025-12-27 15:50:00', '2025-12-27 15:51:35', 2, 100, 5, 'completed', '2025-12-27 15:50:00'),
(133, 12, NULL, 45, NULL, '2025-12-27 16:05:44', '2025-12-27 16:05:47', 1, 0, 1, 'paused', '2025-12-27 16:05:44'),
(134, 12, NULL, 45, NULL, '2025-12-27 16:05:53', '2025-12-27 16:06:08', 1, 30, 1, 'paused', '2025-12-27 16:05:53'),
(135, 11, NULL, 65, NULL, '2025-12-27 16:07:57', '2025-12-27 16:09:19', 2, 100, 5, 'completed', '2025-12-27 16:07:57'),
(136, 6, NULL, 66, NULL, '2025-12-27 16:11:24', '2025-12-27 16:12:24', 1, 100, 5, 'completed', '2025-12-27 16:11:24'),
(137, 6, NULL, 67, NULL, '2025-12-27 16:20:09', '2025-12-27 16:21:09', 1, 100, 5, 'completed', '2025-12-27 16:20:09'),
(138, 16, NULL, 68, NULL, '2025-12-27 18:07:07', '2025-12-27 18:07:46', 1, 100, 5, 'completed', '2025-12-27 18:07:07'),
(139, 16, NULL, 69, NULL, '2025-12-27 18:14:47', '2025-12-27 18:15:40', 1, 100, 5, 'completed', '2025-12-27 18:14:47'),
(140, 16, NULL, 70, NULL, '2025-12-27 18:16:09', '2025-12-27 18:16:27', 1, 10, 1, 'paused', '2025-12-27 18:16:09'),
(141, 13, NULL, 44, NULL, '2025-12-27 18:16:57', '2025-12-27 18:17:48', 1, 100, 5, 'completed', '2025-12-27 18:16:57'),
(142, 13, NULL, 71, NULL, '2025-12-27 18:25:14', '2025-12-27 18:26:16', 2, 100, 5, 'completed', '2025-12-27 18:25:14'),
(143, 13, NULL, 72, NULL, '2025-12-27 18:29:15', '2025-12-27 18:30:08', 1, 80, 4, 'paused', '2025-12-27 18:29:15'),
(144, 16, NULL, 73, NULL, '2025-12-27 18:33:29', '2025-12-27 18:34:58', 2, 90, 4, 'paused', '2025-12-27 18:33:29'),
(145, 10, NULL, 3, NULL, '2025-12-27 18:36:40', '2025-12-27 18:37:29', 1, 40, 2, 'paused', '2025-12-27 18:36:40'),
(146, 10, NULL, 74, NULL, '2025-12-27 18:41:13', '2025-12-27 18:50:56', 10, 40, 2, 'paused', '2025-12-27 18:41:13'),
(147, 13, NULL, 75, NULL, '2025-12-27 18:52:15', '2025-12-27 18:54:03', 2, 50, 2, 'paused', '2025-12-27 18:52:15'),
(148, 13, NULL, 77, NULL, '2025-12-27 18:57:41', '2025-12-27 18:59:07', 2, 60, 3, 'paused', '2025-12-27 18:57:41'),
(149, 13, NULL, 76, NULL, '2025-12-27 18:59:25', '2025-12-27 19:02:58', 4, 0, 1, 'paused', '2025-12-27 18:59:25'),
(150, 13, NULL, 78, NULL, '2025-12-27 19:03:26', '2025-12-27 19:04:24', 1, 40, 2, 'paused', '2025-12-27 19:03:26'),
(151, 13, NULL, 79, NULL, '2025-12-27 19:06:13', '2025-12-27 19:06:59', 1, 50, 2, 'paused', '2025-12-27 19:06:13'),
(152, 6, NULL, 80, NULL, '2025-12-27 19:13:48', '2025-12-27 19:14:54', 2, 60, 3, 'paused', '2025-12-27 19:13:48'),
(153, 6, NULL, 81, NULL, '2025-12-27 19:19:36', '2025-12-27 19:20:28', 1, 60, 3, 'completed', '2025-12-27 19:19:36'),
(154, 16, NULL, 82, NULL, '2025-12-27 19:25:37', '2025-12-27 19:26:43', 2, 60, 3, 'completed', '2025-12-27 19:25:37'),
(155, 12, NULL, 64, NULL, '2025-12-27 19:33:32', '2025-12-27 19:34:34', 2, 60, 3, 'completed', '2025-12-27 19:33:32'),
(156, 12, NULL, 83, NULL, '2025-12-27 19:35:38', '2025-12-27 19:36:48', 2, 90, 4, 'completed', '2025-12-27 19:35:38'),
(157, 13, NULL, 84, NULL, '2025-12-27 19:53:33', '2025-12-27 19:54:41', 2, 80, 4, 'completed', '2025-12-27 19:53:33'),
(158, 8, NULL, 85, 157, '2025-12-27 20:18:42', '2025-12-27 20:20:16', 2, 90, 4, 'completed', '2025-12-27 20:18:42'),
(159, 10, NULL, 86, 125, '2025-12-27 20:55:11', '2025-12-27 20:56:24', 2, 80, 4, 'completed', '2025-12-27 20:55:11'),
(160, 20, NULL, 87, 125, '2025-12-27 21:00:36', '2025-12-27 21:03:17', 3, 70, 3, 'completed', '2025-12-27 21:00:36'),
(161, 20, NULL, 88, 161, '2025-12-27 21:04:41', '2025-12-27 21:06:19', 2, 80, 4, 'completed', '2025-12-27 21:04:41'),
(162, 20, NULL, 89, 152, '2025-12-27 21:07:03', '2025-12-27 21:07:56', 1, 80, 4, 'completed', '2025-12-27 21:07:03'),
(163, 20, NULL, 89, 152, '2025-12-27 21:14:10', '2025-12-27 21:14:14', 1, 0, 1, 'paused', '2025-12-27 21:14:10'),
(164, 20, NULL, 90, 125, '2025-12-27 21:15:20', '2025-12-27 21:16:11', 1, 100, 5, 'completed', '2025-12-27 21:15:20'),
(165, 20, NULL, 91, 125, '2025-12-27 21:40:53', '2025-12-27 21:41:49', 1, 100, 5, 'completed', '2025-12-27 21:40:53'),
(169, 24, NULL, 95, 120, '2025-12-27 22:20:34', '2025-12-27 22:20:45', 1, 0, 0, 'paused', '2025-12-27 22:20:34'),
(170, 24, NULL, 96, 129, '2025-12-27 22:21:33', '2025-12-27 22:22:59', 2, 0, 0, 'completed', '2025-12-27 22:21:33'),
(171, 24, NULL, 97, 111, '2025-12-27 22:23:41', '2025-12-27 22:24:25', 1, 100, 5, 'completed', '2025-12-27 22:23:41'),
(172, 24, NULL, 98, 129, '2025-12-27 22:27:41', '2025-12-27 22:28:35', 1, 40, 2, 'completed', '2025-12-27 22:27:41'),
(173, 24, NULL, 99, 138, '2025-12-27 22:28:41', '2025-12-27 22:30:10', 2, 100, 5, 'completed', '2025-12-27 22:28:41'),
(174, 24, NULL, 100, 156, '2025-12-27 22:31:03', '2025-12-27 22:31:40', 1, 100, 5, 'completed', '2025-12-27 22:31:03'),
(175, 24, NULL, 101, 147, '2025-12-27 22:31:48', '2025-12-27 22:32:31', 1, 100, 5, 'completed', '2025-12-27 22:31:48'),
(178, 25, NULL, 107, 112, '2025-12-28 19:54:02', '2025-12-28 19:56:02', 2, 50, 2, 'completed', '2025-12-28 19:54:02'),
(179, 25, NULL, 104, 130, '2025-12-28 19:56:57', '2025-12-28 19:58:09', 2, 100, 5, 'completed', '2025-12-28 19:56:57'),
(180, 25, NULL, 105, 157, '2025-12-28 19:58:25', '2025-12-28 19:59:29', 2, 100, 5, 'completed', '2025-12-28 19:58:25'),
(181, 25, NULL, 106, 148, '2025-12-28 20:00:43', '2025-12-28 20:01:49', 2, 100, 5, 'completed', '2025-12-28 20:00:43'),
(182, 26, NULL, 108, 152, '2025-12-28 20:29:00', '2025-12-28 20:29:51', 1, 100, 5, 'completed', '2025-12-28 20:29:00'),
(183, 26, NULL, 109, 125, '2025-12-28 20:30:06', '2025-12-28 20:31:13', 2, 60, 3, 'completed', '2025-12-28 20:30:06'),
(184, 28, NULL, 112, 120, '2026-01-04 20:28:34', '2026-01-04 20:29:51', 2, 80, 4, 'completed', '2026-01-04 20:28:34'),
(185, 28, NULL, 110, 129, '2026-01-04 20:30:30', '2026-01-04 20:31:22', 1, 80, 4, 'completed', '2026-01-04 20:30:30'),
(186, 28, NULL, 111, 156, '2026-01-04 20:31:26', '2026-01-04 20:32:19', 1, 100, 5, 'completed', '2026-01-04 20:31:26'),
(187, 28, NULL, 113, 129, '2026-01-04 20:50:29', '2026-01-04 20:51:47', 2, 80, 4, 'completed', '2026-01-04 20:50:29'),
(188, 28, NULL, 114, 147, '2026-01-04 20:58:29', '2026-01-04 21:18:57', 21, 0, 0, 'completed', '2026-01-04 20:58:29'),
(189, 29, NULL, 115, 110, '2026-01-04 21:19:53', '2026-01-04 21:20:59', 2, 40, 2, 'completed', '2026-01-04 21:19:53'),
(190, 30, NULL, 116, 148, '2026-01-04 21:25:55', '2026-01-04 21:26:38', 1, 80, 4, 'completed', '2026-01-04 21:25:55'),
(191, 24, NULL, 117, 129, '2026-01-05 08:57:07', '2026-01-05 08:57:24', 1, 0, 0, 'paused', '2026-01-05 08:57:07'),
(192, 31, NULL, 120, 156, '2026-01-12 14:13:24', '2026-01-12 14:14:29', 2, 80, 4, 'completed', '2026-01-12 14:13:24'),
(193, 31, NULL, 119, 129, '2026-01-12 14:14:59', '2026-01-12 14:15:35', 1, 40, 2, 'paused', '2026-01-12 14:14:59'),
(194, 19, NULL, 121, 141, '2026-01-12 14:18:47', '2026-01-12 14:19:48', 2, 30, 1, 'paused', '2026-01-12 14:18:47'),
(195, 19, NULL, 122, 150, '2026-01-12 14:19:55', '2026-01-12 14:20:45', 1, 70, 3, 'completed', '2026-01-12 14:19:55');

-- --------------------------------------------------------

--
-- بنية الجدول `tasks`
--

CREATE TABLE `tasks` (
  `task_id` int(11) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `child_id` int(11) DEFAULT NULL,
  `content_id` int(11) NOT NULL,
  `task_name` varchar(200) NOT NULL,
  `task_name_ar` varchar(200) NOT NULL,
  `description` text DEFAULT NULL COMMENT 'وصف المهمة',
  `duration_minutes` int(11) DEFAULT 10 COMMENT 'المدة بالدقائق',
  `order_index` int(11) DEFAULT 0 COMMENT 'ترتيب المهمة',
  `status` enum('pending','in_progress','completed','skipped') DEFAULT 'pending' COMMENT 'حالة المهمة',
  `time_completed` int(11) DEFAULT NULL COMMENT 'الوقت المستغرق بالدقائق',
  `parent_note` text DEFAULT NULL COMMENT 'ملاحظات الأهل',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `tasks`
--

INSERT INTO `tasks` (`task_id`, `parent_id`, `child_id`, `content_id`, `task_name`, `task_name_ar`, `description`, `duration_minutes`, `order_index`, `status`, `time_completed`, `parent_note`, `created_at`) VALUES
(2, 3, 12, 113, 'math_game_age_7', 'لعبة الجمع والطرح للعمر 7', NULL, 10, 2, 'completed', 1, 'حليها يا راما', '2025-12-20 10:16:11'),
(3, 3, 10, 134, 'arabic_game_age_10', 'لعبة الحروف العربية للعمر 10', NULL, 10, 1, '', 2147483647, 'حلي يا هدهوده', '2025-12-20 10:22:08'),
(4, 3, NULL, 111, 'math_game_age_5', 'لعبة الجمع والطرح للعمر 5', NULL, 10, 1, 'pending', NULL, NULL, '2025-12-20 10:22:48'),
(5, 3, 12, 131, 'arabic_game_age_7', 'لعبة الحروف العربية للعمر 7', NULL, 2, 1, 'completed', 0, NULL, '2025-12-20 11:21:10'),
(7, 3, 12, 122, 'math_comparison_age_7', 'لعبة المقارنة للعمر 7', NULL, 1, 4, 'completed', 1, NULL, '2025-12-20 12:04:23'),
(8, 3, 12, 140, 'arabic_word_formation_age_7', 'لعبة تكوين الكلمات للعمر 7', NULL, 3, 3, 'completed', 1, NULL, '2025-12-20 12:11:51'),
(9, 3, NULL, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 2, 1, 'pending', NULL, NULL, '2025-12-20 12:18:47'),
(12, 3, 12, 149, 'science_animals_game_age_7', 'لعبة تصنيف الحيوانات للعمر 7', NULL, 1, 5, 'completed', 0, NULL, '2025-12-20 18:10:32'),
(13, 3, 12, 113, 'math_game_age_7', 'لعبة الجمع والطرح للعمر 7', NULL, 3, 7, 'completed', 1, 'حل', '2025-12-23 06:44:19'),
(14, 3, 12, 131, 'arabic_game_age_7', 'لعبة الحروف العربية للعمر 7', NULL, 4, 6, 'completed', 0, NULL, '2025-12-23 06:47:38'),
(16, 3, 12, 140, 'arabic_word_formation_age_7', 'لعبة تكوين الكلمات للعمر 7', NULL, 2, 8, 'completed', 2, NULL, '2025-12-23 07:34:05'),
(17, 3, 12, 122, 'math_comparison_age_7', 'لعبة المقارنة للعمر 7', NULL, 10, 9, 'completed', 0, NULL, '2025-12-23 07:38:26'),
(18, 3, 12, 122, 'math_comparison_age_7', 'لعبة المقارنة للعمر 7', NULL, 10, 10, 'completed', 0, NULL, '2025-12-23 07:59:18'),
(19, 3, 12, 131, 'arabic_game_age_7', 'لعبة الحروف العربية للعمر 7', NULL, 10, 11, '', 0, NULL, '2025-12-23 08:15:20'),
(20, 1, NULL, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 3, 1, '', 0, NULL, '2025-12-23 09:36:48'),
(21, 1, NULL, 141, 'arabic_word_formation_age_8', 'لعبة تكوين الكلمات للعمر 8', NULL, 4, 2, 'pending', NULL, NULL, '2025-12-23 09:48:48'),
(22, 3, 12, 140, 'arabic_word_formation_age_7', 'لعبة تكوين الكلمات للعمر 7', NULL, 3, 12, 'completed', 1, 'حاي يا راما', '2025-12-23 10:24:52'),
(23, 5, 17, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 3, 2, 'pending', NULL, 'حلي يا ميمو', '2025-12-24 13:01:06'),
(24, 5, 17, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 4, 1, 'completed', 0, NULL, '2025-12-24 13:01:52'),
(25, 3, 12, 158, 'science_senses_game_age_7', 'لعبة الحواس الخمسة للعمر 7', NULL, 10, 13, '', 0, NULL, '2025-12-24 13:08:08'),
(35, 3, 13, 115, 'math_game_age_9', 'لعبة الجمع والطرح للعمر 9', NULL, 10, 2, '', 1, NULL, '2025-12-25 22:37:55'),
(36, 3, 13, 124, 'math_comparison_age_9', 'لعبة المقارنة للعمر 9', NULL, 10, 3, '', 1, NULL, '2025-12-25 22:42:12'),
(38, 3, 11, 119, 'math_comparison_age_4', 'لعبة المقارنة للعمر 4', NULL, 10, 4, 'completed', 1, NULL, '2025-12-25 22:53:55'),
(39, 3, 11, 119, 'math_comparison_age_4', 'لعبة المقارنة للعمر 4', NULL, 10, 5, 'completed', 1, NULL, '2025-12-25 22:58:11'),
(42, 3, 16, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 3, '', 0, NULL, '2025-12-25 23:03:55'),
(43, 3, 11, 146, 'science_animals_game_age_4', 'لعبة تصنيف الحيوانات للعمر 4', NULL, 10, 3, 'completed', 0, NULL, '2025-12-25 23:07:41'),
(44, 3, 13, 151, 'science_animals_game_age_9', 'لعبة تصنيف الحيوانات للعمر 9', NULL, 10, 1, 'completed', 2147483647, NULL, '2025-12-25 23:09:48'),
(45, 3, 12, 149, 'science_animals_game_age_7', 'لعبة تصنيف الحيوانات للعمر 7', NULL, 10, 14, '', NULL, NULL, '2025-12-25 23:10:27'),
(47, 3, 16, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 2, '', 0, NULL, '2025-12-25 23:14:27'),
(48, 3, 16, 147, 'science_animals_game_age_5', 'لعبة تصنيف الحيوانات للعمر 5', NULL, 10, 1, '', NULL, NULL, '2025-12-25 23:23:28'),
(49, 1, NULL, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 10, 3, 'pending', NULL, NULL, '2025-12-25 23:36:34'),
(50, 1, NULL, 150, 'science_animals_game_age_8', 'لعبة تصنيف الحيوانات للعمر 8', NULL, 10, 4, 'pending', NULL, NULL, '2025-12-25 23:36:40'),
(51, 3, 11, 137, 'arabic_word_formation_age_4', 'لعبة تكوين الكلمات للعمر 4', NULL, 10, 2, '', NULL, NULL, '2025-12-25 23:37:53'),
(52, 3, 11, 155, 'science_senses_game_age_4', 'لعبة الحواس الخمسة للعمر 4', NULL, 10, 1, '', NULL, NULL, '2025-12-25 23:39:06'),
(53, 6, 18, 123, 'math_comparison_age_8', 'لعبة المقارنة للعمر 8', NULL, 5, 1, '', 2147483647, NULL, '2025-12-26 19:51:37'),
(54, 6, 18, 150, 'science_animals_game_age_8', 'لعبة تصنيف الحيوانات للعمر 8', NULL, 6, 2, 'completed', 2147483647, NULL, '2025-12-26 19:51:52'),
(55, 6, 18, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 4, 3, '', NULL, NULL, '2025-12-26 19:52:05'),
(56, 6, 18, 159, 'science_senses_game_age_8', 'لعبة الحواس الخمسة للعمر 8', NULL, 1, 4, 'completed', 2147483647, NULL, '2025-12-26 20:03:26'),
(57, 6, 18, 141, 'arabic_word_formation_age_8', 'لعبة تكوين الكلمات للعمر 8', NULL, 1, 5, 'completed', 2147483647, NULL, '2025-12-26 20:12:34'),
(58, 6, 18, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 1, 6, '', NULL, NULL, '2025-12-26 20:19:07'),
(59, 6, 18, 114, 'math_game_age_8', 'لعبة الجمع والطرح للعمر 8', NULL, 1, 7, '', 2147483647, NULL, '2025-12-26 20:21:34'),
(60, 6, 18, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 2, 8, '', NULL, NULL, '2025-12-26 20:27:45'),
(61, 6, 18, 159, 'science_senses_game_age_8', 'لعبة الحواس الخمسة للعمر 8', NULL, 1, 9, '', NULL, NULL, '2025-12-26 20:31:01'),
(62, 6, 18, 132, 'arabic_game_age_8', 'لعبة الحروف العربية للعمر 8', NULL, 1, 10, '', NULL, NULL, '2025-12-26 20:34:40'),
(63, 3, 16, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 4, 4, 'completed', 2147483647, NULL, '2025-12-27 15:40:19'),
(64, 3, 12, 122, 'math_comparison_age_7', 'لعبة المقارنة للعمر 7', NULL, 4, 15, 'completed', 2147483647, NULL, '2025-12-27 16:05:35'),
(65, 3, 11, 119, 'math_comparison_age_4', 'لعبة المقارنة للعمر 4', NULL, 4, 6, 'completed', 2147483647, NULL, '2025-12-27 16:07:45'),
(66, 3, 6, 150, 'science_animals_game_age_8', 'لعبة تصنيف الحيوانات للعمر 8', NULL, 4, 2, 'completed', 2147483647, 'حل يا جاسر يا تؤبشني', '2025-12-27 16:11:03'),
(67, 3, 6, 159, 'science_senses_game_age_8', 'لعبة الحواس الخمسة للعمر 8', NULL, 5, 1, 'completed', 2147483647, NULL, '2025-12-27 16:19:49'),
(68, 3, 16, 147, 'science_animals_game_age_5', 'لعبة تصنيف الحيوانات للعمر 5', NULL, 5, 5, 'completed', 2147483647, NULL, '2025-12-27 18:07:01'),
(69, 3, 16, 111, 'math_game_age_5', 'لعبة الجمع والطرح للعمر 5', NULL, 5, 6, 'completed', 2147483647, NULL, '2025-12-27 18:14:39'),
(70, 3, 16, 138, 'arabic_word_formation_age_5', 'لعبة تكوين الكلمات للعمر 5', NULL, 10, 7, '', NULL, NULL, '2025-12-27 18:16:03'),
(71, 3, 13, 151, 'science_animals_game_age_9', 'لعبة تصنيف الحيوانات للعمر 9', NULL, 10, 4, 'completed', 2147483647, NULL, '2025-12-27 18:16:44'),
(72, 3, 13, 151, 'science_animals_game_age_9', 'لعبة تصنيف الحيوانات للعمر 9', NULL, 10, 5, '', NULL, NULL, '2025-12-27 18:29:10'),
(73, 3, 16, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 10, 8, '', 2147483647, NULL, '2025-12-27 18:33:13'),
(74, 3, 10, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 2, '', 2147483647, NULL, '2025-12-27 18:40:52'),
(75, 3, 13, 115, 'math_game_age_9', 'لعبة الجمع والطرح للعمر 9', NULL, 10, 6, '', 2147483647, NULL, '2025-12-27 18:52:08'),
(76, 3, 13, 160, 'science_senses_game_age_9', 'لعبة الحواس الخمسة للعمر 9', NULL, 10, 8, '', 2147483647, NULL, '2025-12-27 18:57:01'),
(77, 3, 13, 115, 'math_game_age_9', 'لعبة الجمع والطرح للعمر 9', NULL, 10, 7, '', 2147483647, NULL, '2025-12-27 18:57:11'),
(78, 3, 13, 124, 'math_comparison_age_9', 'لعبة المقارنة للعمر 9', NULL, 10, 9, '', 2147483647, NULL, '2025-12-27 19:03:16'),
(79, 3, 13, 124, 'math_comparison_age_9', 'لعبة المقارنة للعمر 9', NULL, 10, 10, '', 2147483647, NULL, '2025-12-27 19:06:06'),
(80, 3, 6, 123, 'math_comparison_age_8', 'لعبة المقارنة للعمر 8', NULL, 10, 3, '', 2147483647, NULL, '2025-12-27 19:13:43'),
(81, 3, 6, 123, 'math_comparison_age_8', 'لعبة المقارنة للعمر 8', NULL, 10, 4, 'completed', 2147483647, NULL, '2025-12-27 19:19:27'),
(82, 3, 16, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 10, 9, 'completed', 2147483647, NULL, '2025-12-27 19:25:29'),
(83, 3, 12, 113, 'math_game_age_7', 'لعبة الجمع والطرح للعمر 7', NULL, 10, 16, 'completed', 2147483647, NULL, '2025-12-27 19:32:46'),
(84, 3, 13, 160, 'science_senses_game_age_9', 'لعبة الحواس الخمسة للعمر 9', NULL, 10, 11, 'completed', 2147483647, NULL, '2025-12-27 19:53:28'),
(85, 3, 8, 157, 'science_senses_game_age_6', 'لعبة الحواس الخمسة للعمر 6', NULL, 10, 1, 'completed', 2147483647, NULL, '2025-12-27 20:18:13'),
(86, 3, 10, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 3, 'completed', 2147483647, NULL, '2025-12-27 20:54:57'),
(87, 3, 20, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 1, 'completed', 2147483647, NULL, '2025-12-27 20:57:22'),
(88, 3, 20, 161, 'science_senses_game_age_10', 'لعبة الحواس الخمسة للعمر 10', NULL, 10, 2, 'completed', 2147483647, NULL, '2025-12-27 21:04:16'),
(89, 3, 20, 152, 'science_animals_game_age_10', 'لعبة تصنيف الحيوانات للعمر 10', NULL, 10, 3, 'completed', 2147483647, NULL, '2025-12-27 21:06:45'),
(90, 3, 20, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 4, 'completed', 2147483647, NULL, '2025-12-27 21:15:14'),
(91, 3, 20, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 5, 'completed', 2147483647, NULL, '2025-12-27 21:40:48'),
(92, 3, NULL, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 6, 1, 'completed', 2147483647, NULL, '2025-12-27 22:00:18'),
(93, 3, NULL, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 4, 1, 'completed', 2147483647, NULL, '2025-12-27 22:09:04'),
(94, 3, NULL, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 10, 1, 'completed', 2147483647, NULL, '2025-12-27 22:10:57'),
(95, 3, 24, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 10, 1, '', NULL, NULL, '2025-12-27 22:20:27'),
(96, 3, 24, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 2, 'completed', 2147483647, NULL, '2025-12-27 22:21:13'),
(97, 3, 24, 111, 'math_game_age_5', 'لعبة الجمع والطرح للعمر 5', NULL, 10, 3, 'completed', 2147483647, NULL, '2025-12-27 22:23:35'),
(98, 3, 24, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 4, 'completed', 2147483647, NULL, '2025-12-27 22:27:06'),
(99, 3, 24, 138, 'arabic_word_formation_age_5', 'لعبة تكوين الكلمات للعمر 5', NULL, 10, 5, 'completed', 2147483647, NULL, '2025-12-27 22:27:13'),
(100, 3, 24, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 10, 6, 'completed', 2147483647, NULL, '2025-12-27 22:27:19'),
(101, 3, 24, 147, 'science_animals_game_age_5', 'لعبة تصنيف الحيوانات للعمر 5', NULL, 10, 7, 'completed', 2147483647, NULL, '2025-12-27 22:27:27'),
(104, 7, 25, 130, 'arabic_game_age_6', 'لعبة الحروف العربية للعمر 6', NULL, 6, 2, 'completed', 2147483647, NULL, '2025-12-28 19:46:58'),
(105, 7, 25, 157, 'science_senses_game_age_6', 'لعبة الحواس الخمسة للعمر 6', NULL, 4, 3, 'completed', 2147483647, NULL, '2025-12-28 19:47:12'),
(106, 7, 25, 148, 'science_animals_game_age_6', 'لعبة تصنيف الحيوانات للعمر 6', NULL, 5, 4, 'completed', 2147483647, NULL, '2025-12-28 19:47:27'),
(107, 7, 25, 112, 'math_game_age_6', 'لعبة الجمع والطرح للعمر 6', NULL, 8, 1, 'completed', 2147483647, NULL, '2025-12-28 19:47:48'),
(108, 7, 26, 152, 'science_animals_game_age_10', 'لعبة تصنيف الحيوانات للعمر 10', NULL, 10, 1, 'completed', 2147483647, NULL, '2025-12-28 20:19:00'),
(109, 7, 26, 125, 'math_comparison_age_10', 'لعبة المقارنة للعمر 10', NULL, 10, 2, 'completed', 2147483647, NULL, '2025-12-28 20:19:09'),
(110, 1, 28, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 8, 2, 'completed', 2147483647, NULL, '2026-01-04 20:27:05'),
(111, 1, 28, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 6, 3, 'completed', 2147483647, NULL, '2026-01-04 20:27:14'),
(112, 1, 28, 120, 'math_comparison_age_5', 'لعبة المقارنة للعمر 5', NULL, 5, 1, 'completed', 2147483647, NULL, '2026-01-04 20:27:24'),
(113, 1, 28, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 4, 'completed', 2147483647, NULL, '2026-01-04 20:50:25'),
(114, 1, 28, 147, 'science_animals_game_age_5', 'لعبة تصنيف الحيوانات للعمر 5', NULL, 10, 5, 'completed', 2147483647, NULL, '2026-01-04 20:58:22'),
(115, 1, 29, 110, 'math_game_age_4', 'لعبة الجمع والطرح للعمر 4', NULL, 10, 1, 'completed', 2147483647, NULL, '2026-01-04 21:19:45'),
(116, 1, 30, 148, 'science_animals_game_age_6', 'لعبة تصنيف الحيوانات للعمر 6', NULL, 10, 1, 'completed', 2147483647, NULL, '2026-01-04 21:25:48'),
(117, 3, 24, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 8, '', NULL, NULL, '2026-01-05 08:55:54'),
(118, 3, 24, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 10, 9, 'pending', NULL, NULL, '2026-01-05 08:55:59'),
(119, 10, 31, 129, 'arabic_game_age_5', 'لعبة الحروف العربية للعمر 5', NULL, 10, 2, '', NULL, 'العب يا عون', '2026-01-12 14:12:20'),
(120, 10, 31, 156, 'science_senses_game_age_5', 'لعبة الحواس الخمسة للعمر 5', NULL, 10, 1, 'completed', 2147483647, NULL, '2026-01-12 14:12:26'),
(121, 3, 19, 141, 'arabic_word_formation_age_8', 'لعبة تكوين الكلمات للعمر 8', NULL, 10, 1, '', NULL, NULL, '2026-01-12 14:18:35'),
(122, 3, 19, 150, 'science_animals_game_age_8', 'لعبة تصنيف الحيوانات للعمر 8', NULL, 10, 2, 'completed', 2147483647, NULL, '2026-01-12 14:18:42');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `badges`
--
ALTER TABLE `badges`
  ADD PRIMARY KEY (`badge_id`);

--
-- Indexes for table `children`
--
ALTER TABLE `children`
  ADD PRIMARY KEY (`child_id`),
  ADD KEY `parent_id` (`parent_id`),
  ADD KEY `idx_children_total_stars` (`total_stars`);

--
-- Indexes for table `child_badges`
--
ALTER TABLE `child_badges`
  ADD PRIMARY KEY (`child_badge_id`),
  ADD UNIQUE KEY `unique_child_badge` (`child_id`,`badge_id`),
  ADD KEY `child_id` (`child_id`),
  ADD KEY `badge_id` (`badge_id`);

--
-- Indexes for table `content`
--
ALTER TABLE `content`
  ADD PRIMARY KEY (`content_id`);

--
-- Indexes for table `parents`
--
ALTER TABLE `parents`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `phone` (`phone`);

--
-- Indexes for table `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`report_id`),
  ADD KEY `parent_id` (`parent_id`),
  ADD KEY `child_id` (`child_id`),
  ADD KEY `session_id` (`session_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`session_id`),
  ADD KEY `child_id` (`child_id`),
  ADD KEY `parent_id` (`parent_id`),
  ADD KEY `task_id` (`task_id`),
  ADD KEY `content_id` (`content_id`);

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`task_id`),
  ADD KEY `content_id` (`content_id`),
  ADD KEY `parent_id_idx` (`parent_id`),
  ADD KEY `child_id_idx` (`child_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `badges`
--
ALTER TABLE `badges`
  MODIFY `badge_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `children`
--
ALTER TABLE `children`
  MODIFY `child_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `child_badges`
--
ALTER TABLE `child_badges`
  MODIFY `child_badge_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `content`
--
ALTER TABLE `content`
  MODIFY `content_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=164;

--
-- AUTO_INCREMENT for table `parents`
--
ALTER TABLE `parents`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `reports`
--
ALTER TABLE `reports`
  MODIFY `report_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT for table `sessions`
--
ALTER TABLE `sessions`
  MODIFY `session_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=196;

--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `task_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;

--
-- قيود الجداول المُلقاة.
--

--
-- قيود الجداول `children`
--
ALTER TABLE `children`
  ADD CONSTRAINT `fk_children_parent` FOREIGN KEY (`parent_id`) REFERENCES `parents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- قيود الجداول `child_badges`
--
ALTER TABLE `child_badges`
  ADD CONSTRAINT `fk_child_badges_badge` FOREIGN KEY (`badge_id`) REFERENCES `badges` (`badge_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_child_badges_child` FOREIGN KEY (`child_id`) REFERENCES `children` (`child_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- قيود الجداول `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `fk_reports_child` FOREIGN KEY (`child_id`) REFERENCES `children` (`child_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_reports_parent` FOREIGN KEY (`parent_id`) REFERENCES `parents` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_reports_session` FOREIGN KEY (`session_id`) REFERENCES `sessions` (`session_id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- قيود الجداول `sessions`
--
ALTER TABLE `sessions`
  ADD CONSTRAINT `fk_sessions_child` FOREIGN KEY (`child_id`) REFERENCES `children` (`child_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_sessions_content` FOREIGN KEY (`content_id`) REFERENCES `content` (`content_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_sessions_parent` FOREIGN KEY (`parent_id`) REFERENCES `parents` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_sessions_task` FOREIGN KEY (`task_id`) REFERENCES `tasks` (`task_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- قيود الجداول `tasks`
--
ALTER TABLE `tasks`
  ADD CONSTRAINT `fk_tasks_child` FOREIGN KEY (`child_id`) REFERENCES `children` (`child_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tasks_content` FOREIGN KEY (`content_id`) REFERENCES `content` (`content_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_tasks_parent` FOREIGN KEY (`parent_id`) REFERENCES `parents` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
